Repository: pixelandbrick/sheridantools-prestashop
Catalog: modules/autoupgrade/translations/ModulesAutoupgradeAdmin.*.xlf
Languages: es, fr, pl, ru

source: Restoration failed
es: Restauración fallida
fr: La restauration a échoué
pl: Nie udało się przywrócić danych
ru: Не удалось выполнить восстановление

source: Please try again. You can also send us an error report to help us improve the Update assistant module.
es: Inténtalo de nuevo. También puedes enviarnos un informe de error para ayudarnos a mejorar el módulo Update assistant.
fr: Veuillez réessayer. Vous pouvez également nous envoyer un rapport d'erreur pour nous aider à améliorer le module Update Assistant.
pl: Spróbuj ponownie. Możesz również przesłać nam raport o błędacj, który pomoże nam ulepszyć moduł Asystenta aktualizacji.
ru: Повторите попытку. Вы также можете отправить нам отчет об ошибке, чтобы помочь нам улучшить модуль "Помощник по обновлению".

source: Try again
es: Inténtalo de nuevo
fr: Réessayer
pl: Spróbuj ponownie
ru: Повторить попытку

source: Backup
fr: Sauvegarde
pl: Kopia zapasowa
ru: Резервное копирование

source: OPCache configuration will be changed for the duration of the process.
fr: La configuration d'OPCache sera modifiée pour la durée du processus.

source: No
fr: Non
pl: Nie
ru: Выкл
