Repository: pixelandbrick/sheridantools-prestashop
Catalog: modules/autoupgrade/translations/ModulesAutoupgradeAdmin.*.xlf
Languages: es, fr, pl, ru

source: Patch version
es: Versión del parche
fr: Version corrective
pl: Wersja poprawki
ru: Версия исправления

source: List of core alterations
es: Lista de modificaciones del core
fr: Liste des altérations du core
pl: Lista zmian podstawowych plików
ru: Список основных изменений

source: Some core files have been altered, customization made on these files will be lost during the update.
es: Se han cambiado algunos archivos core, la personalización realizada en estos archivos se perderá durante la actualización.
fr: Certains fichiers du core ont été modifiés, les personnalisations effectuées sur ces fichiers seront perdues lors de la mise à jour.
pl: Niektóre podstawowe pliki zostały zmienione. Modyfikacje wprowadzone w tych plikach zostaną utracone podczas aktualizacji.
ru: Некоторые основные файлы были изменены, и изменения, внесенные в эти файлы, во время обновления будут потеряны.

source: List of theme alterations
es: Lista de modificaciones del tema
fr: Liste des altérations du thème
pl: Lista zmian motywów
ru: Список изменений темы

source: Some theme files have been altered, customization made on these files will be lost during the update.
es: Se han cambiado algunos archivos del tema, la personalización realizada en estos archivos se perderá durante la actualización.
fr: Certains fichiers du thème ont été modifiés, les personnalisations effectuées sur ces fichiers seront perdues lors de la mise à jour.
pl: Niektóre pliki motywów zostały zmienione. Modyfikacje wprowadzone w tych plikach zostaną utracone podczas aktualizacji.
ru: Некоторые файлы темы были изменены, и изменения, внесенные в эти файлы, во время обновления будут потеряны.

source: Access the Module Manager?
es: ¿Acceder al Gestor de Módulos?
fr: Accéder au gestionnaire de modules ?

source: To reach the module manager, you will be logged out of your session and will have to log in again. Do you want to continue?
es: Para acceder al gestor de módulos, se cerrará la sesión y tendrás que iniciar sesión de nuevo. ¿Deseas continuar?
fr: Pour accéder au gestionnaire de modules, vous serez déconnecté de votre session et devrez vous reconnecter. Voulez-vous continuer ?

source: Cancel
es: Cancelar
fr: Annuler
pl: Anuluj
ru: Отмена

source: Go to Module Manager
es: Ir al Gestor de módulos
fr: Accéder au gestionnaire de modules

source: Delete backup
es: Eliminar copia de seguridad
fr: Supprimer la sauvegarde
pl: Usuń kopię zapasową
ru: Удалить резервную копию

source: You are about to delete the %backup_name% backup made on %backup_date%. As it's your only backup, you will be redirected to the module's home page.
es: Estás a punto de eliminar la copia de seguridad %backup_name% realizada el %backup_date%. Como es tu única copia de seguridad, serás redirigido a la página principal del módulo.
fr: Vous êtes sur le point de supprimer la sauvegarde %backup_name% effectuée le %backup_date%. Comme il s'agit de votre seule sauvegarde, vous serez redirigé vers la page d'accueil du module.
pl: Zamierzasz usunąć kopię zapasową %backup_name% utworzoną %backup_date%. Ponieważ jest to jedyna kopia zapasowa, nastąpi przekierowanie na stronę główną modułu.
ru: Вы собираетесь удалить резервную копию %backup_name%, созданную %backup_date%. Поскольку это ваша единственная резервная копия, вы будете перенаправлены на главную страницу модуля.

source: You are about to delete the %backup_name% backup made on %backup_date%.
es: Estás a punto de eliminar la copia de seguridad %backup_name% realizada el %backup_date%.
fr: Vous êtes sur le point de supprimer la sauvegarde %backup_name% effectuée le %backup_date%.
pl: Zamierzasz usunąć kopię zapasową %backup_name% utworzoną %backup_date%.
ru: Вы собираетесь удалить резервную копию %backup_name%, созданную %backup_date%.

source: Delete
es: Eliminar
fr: Supprimer
pl: Usuń
ru: Удаление

source: Restore from a backup?
es: ¿Restaurar desde copia de seguridad?
fr: Restaurer à partir d'une sauvegarde ?
pl: Przywrócić dane z kopii zapasowej?
ru: Восстановить из резервной копии?

source: You are about to restore %backup_version% using the backup from %backup_date%.
es: Está a punto de restaurar %backup_version% utilizando la copia de seguridad de %backup_date%.
fr: Vous êtes sur le point de restaurer %backup_version% en utilisant la sauvegarde de %backup_date%.
pl: Zamierzasz przywrócić wersję %backup_version% przy użyciu kopii zapasowej z %backup_date%.
ru: Вы собираетесь восстановить %backup_version%, используя резервную копию, созданную %backup_date%.

source: List of files missing
es: Falta lista de archivos
fr: Liste des fichiers manquants
pl: Lista brakujących plików
ru: Список отсутствующих файлов

source: List of files changed
es: Lista de archivos modificados
fr: Liste des fichiers modifiés
pl: Lista zmienionych plików
ru: Список измененных файлов

source: Start update?
es: ¿Iniciar actualización?
fr: Démarrer la mise à jour ?
pl: Rozpocząć aktualizację?
ru: Начать обновление?

source: Before starting the update, make sure you have a complete and recent backup of your store (database, files, and images).
es: Antes de iniciar la actualización, asegúrate de tener una copia de seguridad completa y reciente de tu tienda (base de datos, archivos e imágenes).
fr: Avant de commencer la mise à jour, assurez-vous d'avoir une sauvegarde complète et récente de votre boutique (base de données, fichiers et images).
pl: Przed rozpoczęciem aktualizacji upewnij się, że masz pełną i aktualną kopię zapasową sklepu (bazy danych, plików i obrazów).
ru: Перед началом обновления убедитесь, что у вас есть полная и недавняя резервная копия вашего магазина (базы данных, файлов и изображений).

source: You are about to launch the update, do you want to continue?
es: Estas a punto de lanzar la actualización, ¿deseas continuar?
fr: Vous êtes sur le point de lancer la mise à jour, voulez-vous continuer ?
pl: Zamierzasz rozpocząć aktualizację. Kontynuować?
ru: Вы собираетесь запустить обновление. Продолжить?

source: Start update
es: Iniciar actualización
fr: Démarrer la mise à jour
pl: Rozpocznij aktualizację
ru: Начать обновление

source: Start backup?
es: ¿Iniciar copia de seguridad?
fr: Démarrer la sauvegarde ?
pl: Rozpocząć tworzenie kopii zapasowej?
ru: Запустить резервное копирование?

source: Your files, database, and images will be backed up.
es: Se realizarán copias de seguridad de tus archivos, base de datos e imágenes.
fr: Vos fichiers, votre base de données et vos images seront sauvegardés.
pl: Twoje pliki, baza danych i obrazy zostaną dodane do kopii zapasowej.
ru: Будет выполнено резервное копирование файлов, базы данных и изображений.

source: Your files and database will be backed up.
es: Se realizará un backup de tus archivos y base de datos.
fr: Vos fichiers et votre base de données seront sauvegardés.
pl: Zostanie utworzona kopia zapasowa plików i bazy danych.
ru: Будет выполнено резервное копирование файлов и базы данных.

source: Start backup
es: Iniciar copia de seguridad
fr: Démarrer la sauvegarde
pl: Rozpocznij tworzenie kopii zapasowej
ru: Запустить резервное копирование

source: Send error report?
es: ¿Enviar informe de error?
fr: Envoyer un rapport d'erreur ?
pl: Wysłać raport o błędach?
ru: Отправить отчет об ошибке?

source: Help us improve the module by sending us this error report. For your information, the logs will be attached with your message. You can add more details in the description if you wish.
es: Ayúdanos a mejorar el módulo enviándonos este informe de errores. Para tu información, los registros se adjuntarán a tu mensaje. Puedes añadir más detalles en la descripción si lo deseas.
fr: Aidez-nous à améliorer le module en nous envoyant ce rapport d'erreur. Pour information, les logs seront joints à votre message. Vous pouvez ajouter plus de détails dans la description si vous le souhaitez.
pl: Pomóż nam ulepszyć moduł, przesyłając ten raport o błędach. Do Twojej wiadomości zostaną dołączone dzienniki. Jeśli chcesz, możesz dodać więcej informacji w opisie.
ru: Помогите нам улучшить модуль, отправив нам этот отчет об ошибке. К вашему сообщению будут прикреплены файлы журналов. При желании вы можете добавить более подробное описание.

source: Learn more about your data and your rights
es: Infórmate sobre tus datos y tus derechos
fr: En savoir plus sur vos données et vos droits
pl: Dowiedz się więcej o swoich danych i prawach
ru: Узнайте больше о своих данных и правах

source: Error message
es: Mensaje de error
fr: Message d'erreur
pl: Komunikat o błędzie
ru: Сообщение об ошибке

source: Email (optional)
es: Correo electrónico (opcional)
fr: E-mail (optionnel)
pl: Adres e-mail (opcjonalnie)
ru: Эл. почта (необязательно)

source: Enter your email address
es: Introduce tu dirección de correo electrónico
fr: Entrez votre adresse E-mail
pl: Wpisz swój adres e-mail
ru: Введите свой адрес эл. почты

source: Description (optional)
es: Descripción (opcional)
fr: Description (optionnel)
pl: Opis (opcjonalny)
ru: Описание (необязательно)

source: You can add details about the error here.
es: Puedes añadir detalles sobre el error aquí.
fr: Vous pouvez ajouter des détails concernant l'erreur ici.
pl: Tutaj możesz dodać szczegółowe informacje o błędzie.
ru: Здесь вы можете добавить более подробную информацию об ошибке.

source: Send error report
es: Enviar informe de errores
fr: Envoyer un rapport d'erreur
pl: Wyślij raport o błędzie
ru: Отправить отчет об ошибке

source: New available Patch
es: Nuevo parche disponible
fr: Nouvelle version patch disponible

source: New available Minor
es: Nueva versión secundaria disponible
fr: Nouvelle version mineure disponible

source: New available Major
es: Nueva versión principal disponible
fr: Nouvelle version majeure disponible

source: New features are available
es: Nuevas características disponibles
fr: De nouvelles fonctionnalités sont disponibles

source: Description
es: Descripción
pl: Opis
ru: Описание

source: Patches are fixes made between major and minor versions. They introduce security and bug fixes.
es: Los parches son correcciones realizadas entre versiones principales y secundarias. Ofrecen mejoras de seguridad y corrigen errores.
fr: Les versions Patch sont des correctifs faits entre les versions majeures et mineures, qui introduisent des éléments de sécurité et des corrections de bogues.

source: The minor releases introduce new backward-compatible features, security improvements and bug fixes.
es: Las versiones menores introducen nuevas funciones de compatibilidad con versiones anteriores, mejoras de seguridad y correcciones de errores.
fr: Les versions mineures introduisent de nouvelles fonctionnalités rétrocompatibles, des améliorations de sécurité et des corrections de bogues.

source: Major releases introduce new features that may break backward compatibility, as well as new backward-compatible features and bug fixes.
es: Las versiones principales introducen nuevas características que pueden romper la compatibilidad con versiones anteriores, así como nuevas características compatibles con versiones anteriores y correcciones de errores.
fr: Les versions majeures introduisent de nouvelles fonctionnalités susceptibles de rompre la compatibilité descendante, ainsi que de nouvelles fonctionnalités rétrocompatibles et des corrections de bogues.

source: See the update
es: Ver la actualización
fr: Voir la mise à jour

source: Version
es: Versión

source: Type of improvements
es: Tipo de mejoras
fr: Type d'améliorations

source: Bugs, security patches
es: Bugs, parches de seguridad
fr: Bugs, correctifs de sécurité

source: Bugs, security patches, new features
es: Bugs, parches de seguridad, nuevas características
fr: Bugs, correctifs de sécurité, nouvelles fonctionnalités

source: New features, Improvements to existing features, Security and bug fixes
es: Nuevas características, mejoras en las características existentes, seguridad y corrección de errores
fr: Nouvelles fonctionnalités, améliorations des fonctionnalités existantes, sécurité et corrections de bugs

source: Need help?
es: ¿Necesitas ayuda?
fr: Besoin d'aide?

source: If you're having trouble performing the update, consider seeking help from the community or a qualified developer.
es: Si tienes problemas para realizar la actualización, busca ayuda de la comunidad o de un desarrollador cualificado.
fr: Si vous rencontrez des difficultés pour effectuer la mise à jour, vous pouvez demander de l’aide à la communauté ou à un développeur qualifié.

source: Find Support
es: Encontrar soporte
fr: Obtenir de l'aide

source: Remind me later
es: Recuérdamelo más tarde
fr: Me le rappeler plus tard

source: 7 days
es: 7 días
fr: 7 jours

source: 30 days
es: 30 días
fr: 30 jours

source: Until the next version
es: Hasta la próxima versión
fr: Jusqu'à la prochaine version

source: Something went wrong...
es: Algo salió mal...
fr: Quelque chose s'est mal passé...
pl: Wystąpił problem…
ru: Что-то пошло не так...

source: Go back to Update assistant
es: Volver al Update assistant
fr: Retourner sur l'Update Assistant
pl: Wróć do Asystenta aktualizacji
ru: Вернуться в Помощник по обновлению

source: Exit
es: Salir
fr: Quitter
pl: Wyjdź
ru: Выход

source: Save
es: Guardar
fr: Enregistrer
pl: Zapisz
ru: Сохранить

source: Starting
es: Iniciando
fr: Démarrage
pl: Rozpoczęcie
ru: Запуск

source: Local archive
es: Archivo local
fr: Archive locale
pl: Lokalne archiwum
ru: Локальный архив

source: Save the archive file of the version you want to update to in the following directory: /your-admin-directory/autoupgrade/download/
es: Guarda el archivo de la versión a la que deseas actualizar en el siguiente directorio: /your-admin-directory/autoupgrade/download/
fr: Enregistrez l'archive de la version vers laquelle vous souhaitez mettre à jour votre boutique dans le répertoire suivant : /your-admin-directory/autoupgrade/download/
pl: Zapisz plik archiwum wersji, którą chcesz zaktualizować, w katalogu: /twój-katalog-administratora/autoupgrade/download/
ru: Сохраните архивный файл версии, до которой вы хотите выполнить обновление, в следующем каталоге: /your-admin-directory/autoupgrade/download/

source: Privacy policy
es: Política de privacidad
fr: Politique de confidentialité
pl: Polityka prywatności
ru: Политика конфиденциальности

source: Warning summary
es: Resumen de advertencia
fr: Résumé des avertissements
pl: Podsumowanie ostrzeżenia
ru: Сводка предупреждений

source: Error summary
es: Resumen de errores
fr: Résumé de(s) erreur(s)
pl: Podsumowanie błędu
ru: Сводка ошибок

source: See warning
es: Ver advertencia
fr: Voir l'avertissement
pl: Zobacz ostrzeżenie
ru: Посмотреть предупреждение

source: See error
es: Ver error
fr: Voir l'erreur
pl: Zobacz błąd
ru: Посмотреть ошибку

source: Yes
es: Sí
fr: Oui
pl: Tak
ru: Вкл

source: Progress is {progress_percentage}%
es: El progreso es {progress_percentage}%
fr: Progression de {progress_percentage}%
pl: Postęp: {progress_percentage}%
ru: Ход выполнения: {progress_percentage}%

source: Update requirements
es: Requisitos de actualización
fr: Mise à jour des prérequis
pl: Wymagania dotyczące aktualizacji
ru: Требования к обновлению

source: Once all the following conditions are met, you can continue with the update. Read more in the [1]developer documentation[/1].
es: Una vez que se cumplan todas las condiciones siguientes, puedes continuar con la actualización. Lee más en la [1]documentación para desarrolladores[/1].
fr: Une fois que toutes les conditions suivantes sont remplies, vous pouvez poursuivre la mise à jour. Pour en savoir plus, consultez la [1]documentation destinée aux développeurs[/1].
pl: Po spełnieniu wszystkich poniższych warunków możesz kontynuować aktualizację. Dowiedz się więcej w [1]dokumentacji dla programistów[/1].
ru: Как только будут выполнены все следующие условия, вы сможете продолжить обновление. Подробнее см. в [1]документации для разработчиков[/1].

source: Please consider these warnings before continuing with the update. Read more in the [1]developer documentation[/1].
es: Ten en cuenta estas advertencias antes de continuar con la actualización. Lee más en la [1]documentación para desarrolladores[/1].
fr: Veuillez tenir compte de ces avertissements avant de poursuivre la mise à jour. Pour en savoir plus, consultez la [1]documentation destinée aux développeurs[/1].
pl: Przed kontynuowaniem aktualizacji weź pod uwagę te ostrzeżenia. Dowiedz się więcej w [1]dokumentacji dla programistów[/1].
ru: Примите во внимание эти предупреждения, прежде чем продолжить обновление. Подробнее см. в [1]документации для разработчиков[/1].

source: Check requirements again
es: Verifica los requisitos nuevamente
fr: Nouvelle vérification des prérequis
pl: Sprawdź ponownie wymagania
ru: Проверить требования еще раз

source: The requirements check is complete, you can update your store to this version of PrestaShop.
es: La verificación de requisitos ha finalizado, puedes actualizar tu tienda a esta versión de PrestaShop.
fr: La vérification des prérequis est terminée, vous pouvez mettre à jour votre boutique vers cette version de PrestaShop.
pl: Sprawdzanie wymagań zostało ukończone. Możesz zaktualizować sklep do tej wersji PrestaShop.
ru: Проверка требований завершена. Вы можете обновить свой магазин до этой версии PrestaShop.

source: The maximum version of PrestaShop to which you can update your store, based on its PHP version.
es: La versión máxima de PrestaShop a la que puedes actualizar tu tienda, en función de su versión de PHP.
fr: La version maximale de PrestaShop vers laquelle vous pouvez mettre à jour votre boutique, en fonction de sa version PHP.

source: Release note
es: Nota de lanzamiento
pl: Informacje o wersji
ru: Примечание к версии

source: Checking requirements...
es: Comprobando requisitos...
fr: Vérification des prérequis...
pl: Sprawdzanie wymagań…
ru: Проверка требований...

source: Archive to use
es: Archivo a utilizar
fr: Archive à utiliser
pl: Archiwum do użycia
ru: Использовать архив

source: Select an archive
es: Selecciona un archivo
fr: Sélectionner une archive
pl: Wybierz archiwum
ru: Выберите архив

source: XML file to use
es: Archivo XML a utilizar
fr: Fichier XML à utiliser
pl: Plik XML do użycia
ru: Используемый XML-файл

source: Select a file
es: Selecciona un archivo
fr: Sélectionner un fichier
pl: Wybierz plik
ru: Выберите файл

source: No archive found in the following directory: /your-admin-directory/autoupgrade/download/
es: No se encontró ningún archivo en el siguiente directorio: /your-admin-directory/autoupgrade/download/
fr: Aucune archive trouvée dans le répertoire suivant : /your-admin-directory/autoupgrade/download/
pl: Nie znaleziono archiwum w katalogu /twój-katalog-administratora/autoupgrade/download/
ru: Архив не найден в следующем каталоге: /your-admin-directory/autoupgrade/download/

source: Select the backup you want to restore to
es: Selecciona la copia de seguridad que deseas restaurar
fr: Sélectionnez la sauvegarde que vous souhaitez restaurer
pl: Wybierz kopię zapasową, którą chcesz przywrócić
ru: Выберите резервную копию, которую хотите восстановить

source: Delete selection
es: Eliminar selección
fr: Supprimer la sélection
pl: Usuń zaznaczone
ru: Удалить выбранное

source: The requested page or resource could not be found. This might be due to:
es: No se pudo encontrar la página o el recurso solicitado. Esto podría deberse a:
fr: La page ou la ressource demandée n'a pas pu être trouvée. Cela peut être dû à :
pl: Nie można znaleźć żądanej strony lub zasobu. Możliwe przyczyny:
ru: Не удалось найти запрошенную страницу или ресурс. Возможные причины:

source: A broken or outdated link.
es: Un enlace roto o desactualizado.
fr: Un lien brisé ou obsolète.
pl: Nieprawidłowe lub nieaktualne łącze.
ru: Поврежденная или устаревшая ссылка.

source: The page being moved or deleted.
es: La página se ha movido o eliminado.
fr: La page est déplacée ou supprimée.
pl: Strona jest w trakcie przenoszeniaq lub usuwania.
ru: Страница перемещена или удалена.

source: A typo in the URL.
es: Un error tipográfico en la URL.
fr: Une faute de frappe dans l'URL.
pl: Błąd w adresie URL.
ru: Опечатка в URL-адресе.

source: It seems there was an issue with the server. This type of error usually happens when:
es: Parece que hubo un problema con el servidor. Este tipo de error suele ocurrir cuando:
fr: Il semble qu'il y ait eu un problème avec le serveur. Ce type d'erreur se produit généralement lorsque :
pl: Wystąpił problem z serwerem. Błędy tego typu zwykle występują, gdy:
ru: Похоже, возникла проблема с сервером. Частые причины таких ошибок:

source: The server is temporarily unavailable.
es: El servidor no está disponible temporalmente.
fr: Le serveur est temporairement indisponible.
pl: Serwer jest tymczasowo niedostępny.
ru: Сервер временно недоступен.

source: There's a misconfiguration or unexpected problem on the server.
es: Hay una configuración incorrecta o un problema inesperado en el servidor.
fr: Il y a une mauvaise configuration ou un problème inattendu sur le serveur.
pl: Na serwerze wystąpił błąd konfiguracji lub nieoczekiwany problem.
ru: Неправильная конфигурация или непредвиденная проблема на сервере.

source: It looks like there is no data received from the server. This can happen if:
es: Parece que no se reciben datos del servidor. Esto puede ocurrir si:
fr: Il semble qu'il n'y ait aucune donnée reçue du serveur. Cela peut se produire si :
pl: Z serwera nie odebrano żadnych danych. Możliwe przyczyny:
ru: Похоже, данные с сервера не поступают. Возможные причины:

source: There's an issue with the network or connection.
es: Hay un problema con la red o la conexión.
fr: Il y a un problème avec le réseau ou la connexion.
pl: Wystąpił problem z siecią lub połączeniem.
ru: Возникла проблема с сетью или подключением.

source: The request timed out. It seems the connection took too long to respond. This could be due to:
es: Se agotó el tiempo de espera de la solicitud. Parece que la conexión tardó demasiado en responder. Esto podría deberse a:
fr: La requête a expiré. Il semble que la connexion ait mis trop de temps à répondre. Cela peut être dû à :
pl: Upłynął limit czasu żądania. Odpowiedź na połączenie trwała zbyt długo. Możliwe przyczyny:
ru: Время ожидания запроса истекло. Похоже, при попытке установить соединение слишком долго не было ответа. Возможные причины:

source: A slow or unstable internet connection.
es: Una conexión a Internet lenta o inestable.
fr: Une connexion Internet lente ou instable.
pl: Wolne lub niestabilne połączenie z internetem.
ru: Медленное или нестабильное подключение к Интернету.

source: The server is currently busy or unresponsive.
es: El servidor está actualmente ocupado o no responde.
fr: Le serveur est actuellement occupé ou ne répond pas.
pl: Serwer jest obecnie zajęty lub nie odpowiada.
ru: Сервер в текущий момент занят или не отвечает.

source: Temporary network issues.
es: Problemas temporales de red.
fr: Problèmes de réseau temporaires.
pl: Tymczasowe problemy z siecią.
ru: Временные проблемы с сетью.

source: The response received from the server in malformed. This can happen if:
es: La respuesta recibida del servidor está mal formada. Esto puede ocurrir si:
fr: La réponse reçue du serveur est malformée. Cela peut se produire si :
pl: Odpowiedź otrzymana z serwera jest nieprawidłowa. Możliwe przyczyny:
ru: Ответ, полученный от сервера, имеет неправильный формат. Возможные причины:

source: The request did not reach the module.
es: La solicitud no llegó al módulo.
fr: La requête n'a pas atteint le module.
pl: Żądanie nie dotarło do modułu.
ru: Запрос не дошел до модуля.
