Repository: pixelandbrick/sheridantools-prestashop
Catalog: modules/autoupgrade/translations/ModulesAutoupgradeAdmin.*.xlf
Languages: es, fr, pl, ru

source: Unable to retrieve the recommended releases of Update Assistant.
es: No se pueden recuperar las versiones recomendadas de Update Assistant.
fr: Impossible de récupérer les versions recommandées d'Update Assistant.

source: Action %s skipped
es: Acción %s omitida
fr: L'action %s a été ignorée
pl: Akcja %s pominięta
ru: Действие %s пропущено

source: Restoration process done. Congratulations! You can now reactivate your store.
es: Proceso de restauración completado. ¡Enhorabuena! Ya puedes reactivar tu tienda.
fr: Processus de restauration terminé. Félicitations ! Vous pouvez désormais réactiver votre boutique.
pl: Proces przywracania został zakończony. Gratulacje! Możesz teraz ponownie aktywować sklep.
ru: Процесс восстановления завершен. Поздравляем! Теперь вы можете снова активировать свой магазин.

source: Running opcache_reset
es: Ejecutando opcache_reset
fr: Exécution d'opcache_reset
pl: Uruchamianie opcache_reset
ru: Запуск "opcache_reset"

source: Nothing to restore
es: Nada que restaurar
fr: Rien à restaurer
pl: Nic do przywrócenia
ru: Данные для восстановления отсутствуют

source: Database restoration done.
es: Restauración de base de datos realizada.
fr: Restauration de la base de donnée terminée
pl: Przywrócenie bazy danych zakończone.
ru: Восстановление базы данных завершено.

source: Error during database restoration:
es: Error durante la restauración de la base de datos:
fr: Erreur lors de la restauration de la base de données:
pl: Błąd podczas przywracania bazy danych:
ru: Ошибка при восстановлении базы данных:

source: %s: File format does not match.
es: %s: El formato de archivo no coincide.
fr: %s : le format de fichier ne correspond pas.
pl: %s: Format pliku nie pasuje.
ru: %s: Формат файла не подходит.

source: Opening backup database file %filename% in %extension% mode
es: Apertura del archivo de base de datos de respaldo %filename% en modo %extension%
fr: Ouverture du fichier de sauvegarde %filename% en mode %extension%.
pl: Otwieranie pliku bazy danych kopii zapasowej %filename% w trybie %extension%
ru: Открываем резервную копию БД %filename% в режиме %extension%

source: Database backup is empty.
es: La copia de seguridad de la base de datos está vacía.
fr: La sauvegarde de la base de données est vide.
pl: Kopia zapasowa bazy danych jest pusta.
ru: Резервная копия базы данных пуста.

source: No tables matching the prefix "%s" were found in the database.
es: No se encontraron tablas que coincidan con el prefijo "%s" en la base de datos.
fr: Aucune table correspondant au préfixe «%s» n'a été trouvée dans la base de données.

source: %s file(s) will be removed before restoring the backup files.
es: Se eliminarán %s archivos antes de restaurar los archivos de respaldo.
fr: %s fichier(s) seront supprimés avant la restauration des fichiers sauvegardés.
pl: Przed przywróceniem plików kopii zapasowej zostanie usunięta następująca liczba plików: %s.
ru: Перед восстановлением из резервной копии будет удалено файлов: %s.

source: Backup file %s does not exist.
es: El archivo de copia de seguridad %s no existe.
fr: Le fichier de sauvegarde %s n'existe pas.
pl: Plik kopii zapasowej %s nie istnieje.
ru: Файл резервной копии %s не существует.

source: File "%s" does not exist.
es: El archivo "%s" no existe.
fr: Le fichier «%s» n'existe pas.
pl: Plik „%s” nie istnieje.
ru: Файл "%s" не существует.

source: Unable to remove updated files.
es: No se pueden eliminar los archivos actualizados.
fr: Impossible de supprimer les fichiers mis à jour.
pl: Nie można usunąć zaktualizowanych plików.
ru: Не удалось удалить обновленные файлы.

source: Unable to extract file %filename% into directory %directoryname%.
es: No se puede extraer el archivo %filename% en el directorio %directoryname%.
fr: Impossible d'extraire le fichier %filename% dans le dossier %directoryname%.
pl: Nie można rozpakować pliku %filename% do katalogu %directoryname%.
ru: Не удалось извлечь файл %filename% в директорию %directoryname%.

source: Files restored.
es: Archivos restaurados.
fr: Fichiers restaurés.
pl: Pliki przywrócone.
ru: Файлы восстановлены.

source: Files restored. Now restoring database...
es: Archivos restaurados. Restaurando la base de datos...
fr: Fichiers restaurés. Restauration de la base de données...
pl: Pliki przywrócone. Teraz przywracanie bazy danych...
ru: Файлы восстановлены. Идёт восстановление базы данных...

source: File %s is missing: unable to restore files. Operation aborted.
es: Falta el archivo %s : no se pueden restaurar los archivos. Operación cancelada.
fr: Le fichier %s est manquant : impossible de restaurer les fichiers. Opération annulée.
pl: Brak pliku %s: nie można przywrócić plików. Operacja przerwana.
ru: Файл %s отсутствует: не удалось восстановить файлы. Операция прервана.

source: No backup database files found: it would be impossible to restore the database. Operation aborted.
es: No se encontraron archivos de backup de la base de datos: sería imposible restaurarla. Operación cancelada.
fr: Aucun fichier de sauvegarde de base de données n'a été trouvé : il serait donc impossible de restaurer la base de données. Opération abandonnée.
pl: Nie znaleziono plików kopii zapasowej bazy danych: przywrócenie bazy danych byłoby niemożliwe. Operacja przerwana.
ru: Файлы резервной копии базы данных не найдены: восстановить базу данных будет невозможно. Операция прервана.

source: Restoring files ...
es: Restaurando archivos...
fr: Restauration des fichiers...
pl: Przywracanie plików ...
ru: Восстановление файлов ...

source: Backup completed successfully.
es: Copia de seguridad completada exitosamente.
fr: Sauvegarde terminée avec succès.
pl: Kopia zapasowa została utworzona.
ru: Резервное копирование успешно завершено.

source: An error occurred while backing up. Unable to obtain the schema of %s
es: Se produjo un error al realizar la copia de seguridad. No se pudo obtener el esquema de %s
fr: Une erreur est apparue lors de la sauvegarde. Impossible d'obtenir le schema de %s
pl: Wystąpił błąd podczas tworzenia kopii zapasowej. Nie można uzyskać schematu %s
ru: При создании резервной копии возникла ошибка. Невозможно получить схему %s

source: Error during database backup.
es: Error durante la copia de seguridad de la base de datos.
fr: Erreur pendant la sauvegarde de la base de données
pl: Wystąpił błąd podczas tworzenia kopii zapasowej bazy danych.
ru: Ошибка при создании резервной копии базы данных.

source: %s table has been saved.
es: La tabla %s se ha guardado.
fr: La table %s a été sauvegardée.
pl: Tabela %s została zapisana.
ru: Таблица %s сохранена.

source: %s tables have been saved.
es: Se han guardado %s tablas.
fr: %s tables ont été sauvegardées.
pl: %s tabel zostało zapisanych.
ru: Сохранено таблиц: %s.

source: Database backup: %s table(s) left...
es: Copia de seguridad de la base de datos: quedan %s tabla(s)...
fr: Sauvegarde de la base de données : %s table(s) restantes...
pl: Tworzenie kopii zapasowej bazy danych: pozostało %s tabel(e)...
ru: Резервное копирование базы данных. Осталось таблиц: %s...

source: Database backup done in filename %s.
es: La copia de seguridad de la base de datos se realizó en el nombre de archivo %s.
fr: Sauvegarde de la base de données effectuée avec le nom de fichier %s.
pl: Kopia zapasowa bazy danych została wykonana w pliku %s.
ru: Резервное копирование базы данных выполнено в файл с именем %s.

source: Backup directory is not writable (%path%).
es: El directorio de respaldo no se puede escribir (%path%).
fr: Chemin de sauvegarde interdit en écriture (%path%).
pl: Katalog kopii zapasowej nie jest zapisywalny (%path%).
ru: Запись в директорию резервных копий запрещена (%path%).

source: No valid tables were found to back up. Backup of database canceled.
es: No se encontraron tablas válidas para respaldar. Se canceló la copia de seguridad de la base de datos.
fr: Aucune table valide n'a été trouvée pour permettre la sauvegarde. La sauvegarde de la base de données a donc été annulée.
pl: Nie znaleziono prawidłowych tabel do wykonania kopii zapasowej. Tworzenie kopii zapasowej bazy danych zostało anulowane.
ru: Не найдены допустимые таблицы для резервного копирования. Резервное копирование базы данных отменено.

source: Backup file %s already exists. Operation aborted.
es: El archivo de respaldo %s ya existe. Operación cancelada.
fr: Le fichier %s existe déjà. Opération annulée.
pl: Plik kopii zapasowej %s już istnieje. Operacja przerwana.
ru: Файл резервной копии %s уже существует. Действие отменено.

source: Unable to create backup database file %s.
es: No se puede crear el archivo de base de datos de respaldo %s.
fr: Impossible de créer le fichier %s de sauvegarde de la base de données.
pl: Nie można utworzyć pliku kopii zapasowej bazy danych %s.
ru: Невозможно создать файл резервной копии базы данных %s.

source: Starting backup...
es: Iniciando copia de seguridad...
fr: Démarrage de la sauvegarde...
pl: Rozpoczynanie tworzenia kopii zapasowej…
ru: Запуск резервного копирования...

source: All files have been added to archive.
es: Todos los archivos se han añadido al archivo.
fr: Tous les fichiers ont été ajoutés à l'archive.
pl: Wszystkie pliki zostały dodane do archiwum.
ru: Все файлы добавлены в архив.

source: All files saved. Now backing up database
es: Se guardaron todos los archivos. Ahora se está realizando una copia de seguridad de la base de datos
fr: Tous les fichiers sont enregistrés. Sauvegarde de la base de données
pl: Wszystkie pliki zapisane. Teraz tworzenie kopii zapasowej bazy danych
ru: Все файлы сохранены. Идет резерное копирование базы данных

source: Unable to open archive
es: No se puede abrir el archivo
fr: Impossible d'ouvrir l'archive
pl: Nie można otworzyć archiwum
ru: Не удалось открыть архив

source: Backup files in progress. %d files left
es: Archivos de respaldo en proceso. Quedan %d archivos
fr: Sauvegarde des fichiers en cours. Encore %d fichiers.
pl: Trwa tworzenie kopii zapasowej plików. Pozostało %d plików
ru: Копирование файлов. Осталось: %d

source: Backup filename has not been set
es: No se ha establecido el nombre de la copia de seguridad
fr: Le nom du fichier de sauvegarde n'a pas été défini
pl: Nazwa pliku kopii zapasowej nie została ustawiona
ru: Имя файла резервной копии не задано

source: Starting update...
es: Iniciando actualización...
fr: Démarrage de la mise à jour...
pl: Uruchamianie aktualizacji…
ru: Запуск обновления...

source: Your store is currently running the latest compatible version. No updates are needed at this time.
es: Tu tienda está ejecutando la última versión compatible. No se necesitan actualizaciones en este momento.
fr: Votre boutique utilise actuellement la dernière version compatible. Aucune mise à jour n'est nécessaire pour le moment.
pl: Twój sklep jest obecnie w najnowszej kompatybilnej wersji. Aktualizacja nie jest teraz wymagana.
ru: В вашем магазине в настоящее время используется последняя совместимая версия. На данный момент обновления не требуются.

source: Destination version: %s
es: Versión de destino: %s
fr: Version de destination : %s
pl: Wersja docelowa: %s
ru: Целевая версия: %s

source: Downloading step has been skipped, update process will now unzip the local archive.
es: Se ha omitido el paso de descarga, el proceso de actualización descomprimirá el archivo local.
fr: L'étape de téléchargement a été ignorée, le processus de mise à jour va maintenant décompresser l'archive locale.
pl: Krok pobierania został pominięty. Proces aktualizacji rozpakuje teraz lokalne archiwum.
ru: Этап скачивания пропущен, в процессе обновления будет распакован локальный архив.

source: Store deactivated. Extracting files...
es: Tienda desactivada. Extrayendo archivos...
fr: Boutique désactivée. Extraction des fichiers...
pl: Sklep został zdezaktywowany. Wyodrębnianie plików…
ru: Магазин деактивирован. Извлечение файлов...

source: Store deactivated. Now downloading... (this can take a while)
es: Tienda desactivada. Descargando ahora... (puede tardar un poco)
fr: Boutique désactivée. Téléchargement en cours... (cela peut prendre un certain temps)
pl: Sklep został zdezaktywowany. Trwa pobieranie… (może to chwilę potrwać)
ru: Магазин деактивирован. Выполняется скачивание... (это может занять некоторое время)

source: Downloaded archive will come from %s
es: El archivo descargado proviene de %s
fr: L'archive téléchargée viendra de %s
pl: Pobrane archiwum będzie pochodzić z %s
ru: Архив будет загружен из %s

source: MD5 hash will be checked against %s
es: Hash MD5 se cotejará con %s
fr: Le hash MD5 va être comparé à %s
pl: MD5 będą sprawdzane z %s
ru: Сравнение хеш-суммы MD5 с %s

source: Shop updated to %s, but some warnings have been found.
es: Tienda actualizada a %s, pero se han encontrado algunas advertencias.
fr: Boutique mise à jour vers %s, mais certains avertissements ont été trouvés.
pl: Sklep został zaktualizowany do wersji %s, ale wystąpiło kilka ostrzeżeń.
ru: Магазин обновлен до %s, но обнаружены предупреждения.

source: Shop updated to %s. Congratulations! You can now reactivate your shop.
es: Tienda actualizada a %s. ¡Enhorabuena! Ya puedes reactivar tu tienda.
fr: Boutique mise à jour vers %s. Félicitations ! Vous pouvez maintenant réactiver votre boutique.
pl: Sklep został zaktualizowany do wersji %s. Gratulacje! Możesz teraz ponownie aktywować sklep.
ru: Магазин обновлен до %s. Поздравляем! Теперь вы можете снова активировать свой магазин.

source: Please remove %s by FTP
es: Por favor, elimina %s desde FTP
fr: Veuillez supprimer %s via FTP
pl: Proszę usunąć %s przez FTP
ru: Удалите %s на FTP

source: The temporary directory of modules has been emptied
es: El directorio temporal de módulos se ha vaciado
fr: Le répertoire temporaire des modules a été vidé
pl: Tymczasowy katalog modułów został opróżniony
ru: Временный каталог модулей очищен

source: %s removed
es: %s eliminado
fr: %s supprimé
pl: %s usunięto
ru: %s удалён

source: All files updated. Now updating database...
es: Todos los archivos actualizados. Actualizando la base de datos...
fr: Tous les fichiers sont à jour. Mise à jour de la base de données en cours...
pl: Wszystkie pliki zostały zaktualizowane. Trwa aktualizowanie bazy danych…
ru: Все файлы обновлены. Выполняется обновление базы данных...

source: Error when trying to update file %s.
es: Error al intentar actualizar el archivo %s.
fr: Erreur lors de la tentative de mise à jour du fichier %s.
pl: Błąd podczas próby aktualizacji pliku %s.
ru: Ошибка при попытке обновления файла %s.

source: %s files left to update.
es: Quedan %s archivos por actualizar.
fr: %s fichiers restant à mettre à jour.
pl: Liczba pozostałych plików do aktualizacji: %s.
ru: Осталось обновить файлов: %s.

source: %s ignored
es: %s ignorado
fr: %s ignoré
pl: %s zignorowano
ru: %s проигнорировано

source: Created link %s to %s.
es: Se creó el enlace %s a %s.
fr: Lien créé %s vers %s.

source: Error while creating link %s: %s
es: Error al crear el enlace %s: %s
fr: Erreur lors de la création du lien %s: %s

source: File %1$s has been deleted.
es: El archivo %1$s ha sido eliminado.
fr: Le fichier %1$s a été supprimé.
pl: Plik %1$s został usunięty.
ru: Файл %1$s удален.

source: Directory %1$s created.
es: Directorio %1$s creado.
fr: Répertoire %1$s créé.
pl: Katalog %1$s został utworzony.
ru: Директория %1$s создана.

source: Error while creating directory %s: %s.
es: Error al crear el directorio %s: %s.
fr: Erreur lors de la création du répertoire %s : %s.
pl: Błąd podczas tworzenia katalogu %s: %s.
ru: Ошибка при создании каталога %s: %s.

source: Directory %s already exists.
es: El directorio %s ya existe.
fr: Le répertoire %s existe déjà.
pl: Katalog %s już istnieje.
ru: Директория %s уже существует.

source: The translation files have been merged into file %s.
es: Los archivos de traducción se han fusionado en el archivo %s.
fr: Les fichiers de traduction ont été fusionnés dans le fichier %s.
pl: Pliki tłumaczeń zostały scalone w pliku %s.
ru: Файлы перевода объединены в файл %s.

source: The translation files have not been merged into file %filename%. Switch to copy %filename%.
es: Los archivos de traducción no se han combinado con el archivo %filename%. Cambiar a la copia %filename%.
fr: Les fichiers de traduction n'ont pas été fusionnés dans le fichier %filename%. Passage à la copie %filename%.
pl: Pliki tłumaczeń nie zostały scalone w pliku %filename%. Przełącz, aby skopiować plik %filename%.
ru: Файлы перевода не объединены в файл %filename%. Переключитесь, чтобы скопировать %filename%.

source: Copied %1$s.
es: Copiado %1$s.
fr: %1$s copié.
pl: Skopiowano %1$s.
ru: Скопировано %1$s.

source: Unable to copy %s, but ignoring as source and destination appear identical.
es: No se puede copiar %s, pero se ignora porque el origen y el destino parecen idénticos.
fr: Impossible de copier %s, mais l'erreur est ignorée car la source et la destination sont identiques.

source: Error while copying file %s: %s
es: Error al copiar el archivo %s: %s
fr: Erreur lors de la copie du fichier %s : %s
pl: Błąd podczas kopiowania pliku %s: %s
ru: Ошибка при копировании файла %s: %s

source: Could not assert the folder %s contains a valid PrestaShop release, exiting.
es: No se pudo segurar que la carpeta %s contenga una versión válida de PrestaShop, saliendo.
fr: Impossible de vérifier que le dossier %s contient une version valide de PrestaShop, arrêt en cours.
pl: Nie można sprawdzić, czy folder %s zawiera prawidłową wersję PrestaShop, nastąpi wyjście.
ru: Завершение, так как не удаётся проверить, что папка %s содержит корректную версию PrestaShop.

source: A file may be missing, or the release is stored in a subfolder by mistake.
es: Es posible que falte un archivo o que el lanzamiento de la descarga se almacene en una subcarpeta por error.
fr: Un fichier peut être manquant, ou la version est stockée dans un sous-dossier par erreur.
pl: Może brakować pliku lub wydanie zostało przez pomyłkę zapisane w podfolderze.
ru: Возможно, отсутствует файл или релиз был по ошибке помещён в подпапку.

source: Generate diff file list between %s and %s.
es: Generar lista de archivos diff entre %s y %s.
fr: Génération d'une liste de fichiers diff entre %s et %s.
pl: Wygeneruj listę plików diff między wersjami %s a %s.
ru: Создайте список различий файлов между %s и %s.

source: Unable to generate diff file list between %s and %s.
es: No se puede generar la lista de archivos diff entre %s y %s.
fr: Impossible de générer la liste des fichiers diff entre %s et %s.
pl: Nie można wygenerować listy plików diff między wersjami %s a %s.
ru: Не удалось создать список различий файлов между %s и %s.

source: Unable to find files to update.
es: No se pueden encontrar archivos para actualizar.
fr: Impossible de trouver les fichiers à mettre à jour.
pl: Nie można znaleźć plików do zaktualizowania.
ru: Не удалось найти файлы для обновления.

source: %s files will be updated.
es: Los archivos %s se actualizarán.
fr: %s fichiers seront mis à jour.
pl: Liczba plików, które zostaną zaktualizowane: %s.
ru: Будет обновлено файлов: %s.

source: Checking updates of module %module%...
es: Comprobando actualizaciones del módulo %module%...
fr: Vérification des mises à jour du module %module%...
pl: Sprawdzanie dostępności aktualizacji modułu %module%…
ru: Проверка наличия обновлений модуля %module%...

source: Module %module% is up-to-date.
es: El módulo %module% está actualizado.
fr: Le module %module% est à jour.
pl: Moduł %module% jest aktualny.
ru: Модуль %module% обновлен.

source: Retrieving the module instance of %s failed.
es: Error al recuperar la instancia del módulo de %s.
fr: La récupération de l'instance du module %s a échoué.
pl: Pobieranie instancji modułu %s się nie powiodło.
ru: Не удалось получить экземпляр модуля %s.

source: Module %s does not need to be migrated. Module is up to date.
es: El módulo %s no necesita ser migrado. El módulo está actualizado.
fr: Le module %s n'a pas besoin d'être migré. Le module est à jour.
pl: Moduł %s nie wymaga migracji. Moduł jest aktualny.
ru: Перенос модуля %s не требуется. Модуль обновлен.

source: %s modules left to check.
es: Quedan %s módulos por revisar.
fr: %s modules restant à vérifier.
pl: Liczba pozostałych modułów do sprawdzenia: %s.
ru: Осталось проверить модулей: %s.

source: All modules have been updated.
es: Todos los módulos han sido actualizados.
fr: Tous les modules ont été mis à jour.
pl: Wszystkie moduły zostały zaktualizowane.
ru: Все модули обновлены.

source: %s modules will be updated.
es: Los módulos %s se actualizarán.
fr: %s modules seront mis à jour.
pl: Liczba modułów, które zostaną zaktualizowane: %s.
ru: Будет обновлено модулей: %s.

source: Temporary files directory has been emptied
es: El directorio de archivos temporales ha sido vaciado
fr: Le répertoire des fichiers temporaires a été vidé
pl: Katalog plików tymczasowych został opróżniony
ru: Содержимое каталога временных файлов удалено

source: Extraction directory %s is not writable.
es: El directorio de extracción %s no tiene permisos de escritura.
fr: Impossible d'écrire dans le dossier d'extraction %s.
pl: Katalog rozpakowywania %s nie jest zapisywalny.
ru: Директория %s защищена от записи.

source: Unable to extract %filepath% file into %destination% folder...
es: No se puede extraer el archivo %filepath% en la carpeta de destino %destination%...
fr: Impossible d'extraire le fichier %filepath% vers le dossier %destination%...
pl: Nie można rozpakować pliku %filepath% do folderu %destination%...
ru: Невозможно распаковать файл %filepath% в папку %destination%...

source: No prestashop/ folder found in the ZIP file. Aborting.
es: No se encontró el directorio prestashop/ en el archivo ZIP. Cancelando el proceso.
fr: Aucun dossier prestashop/ trouvé dans le fichier ZIP. Abandon.
pl: Nie znaleziono folderu prestashop/ w pliku ZIP. Przerwanie.
ru: В архиве отсутствует папка prestashop/. Отмена действия.

source: File extraction complete. Now updating files...
es: Extracción de archivo completa. Actualizando archivos...
fr: Extraction du fichier terminée. Mise à jour des fichiers en cours...
pl: Wyodrębnianie pliku zostało ukończone. Trwa aktualizowanie plików…
ru: Извлечение файлов завершено. Выполняется обновление файлов...

source: Update database in progress. %d queries left
es: Actualización de la base de datos en curso. Quedan %d consultas
fr: Mise à jour de la base de données en cours. %d requêtes restantes
pl: Trwa aktualizowanie bazy danych. Liczba pozostałych zapytań: %d
ru: Выполняется обновление базы данных. Осталось запросов: %d

source: Error during database update. You may need to restore your database.
es: Error durante la actualización de la base de datos. Es posible que debas restaurarla.
fr: Erreur lors de la mise à jour de la base de données. Vous devrez peut-être restaurer votre base de données.
pl: Błąd podczas aktualizowania bazy danych. Może być konieczne przywrócenie bazy danych.
ru: Ошибка при обновлении базы данных. Возможно, потребуется восстановить базу данных.

source: Database updated. Now updating your Addons modules...
es: Base de datos actualizada. Actualizando ahora tus módulos de Addons...
fr: Base de données mise à jour. Mise à jour de vos modules Addons en cours...
pl: Baza danych została zaktualizowana. Trwa aktualizowanie modułów dodatków…
ru: База данных обновлена. Выполняется обновление модулей расширений...

source: Cleaning file cache
es: Limpiando caché de archivos
fr: Nettoyage du cache des fichiers
pl: Czyszczenie pamięci podręcznej plików
ru: Очистка кэша файлов

source: Updating database data and structure
es: Actualizando base de datos y estructura
fr: Mise à jour des données et de la structure de la base de données
pl: Aktualizowanie danych i struktury bazy danych
ru: Обновление данных и структуры базы данных
