Repository: pixelandbrick/sheridantools-prestashop
Catalog: modules/autoupgrade/translations/ModulesAutoupgradeAdmin.*.xlf
Languages: es, fr, pl, ru

source: , but ignoring as source and destination appear identical
es: , pero ignorando que el origen y el destino parecen idénticos
fr: , mais l'erreur est ignorée car la source et la destination sont identiques

source: Could not extract %file% from archive%nonCriticalIssueNotice%: %$issue%.
es: No se pudo extraer %file% del archivo%nonCriticalIssueNotice%: %$issue%.
fr: Impossible d'extraire %file% de l'archive%nonCriticalIssueNotice% : %$issue%.

source: Could not extract link %file% from archive: %error%
es: No se pudo extraer %file% del archivo: %error%
fr: Impossible d'extraire le lien %file% de l'archive : %error%

source: Content of archive %zip% is extracted
es: Se extrae el contenido del archivo %zip%
fr: Extraction du contenu de l'archive %zip% réalisée avec succès
pl: Zawartość archiwum %zip% została wypakowana
ru: Содержимое архива %zip% извлечено

source: Unable to list archived files
es: No se pueden listar los archivos archivados
fr: Impossible de lister les fichiers archivés
pl: Nie można wyświetlić listy zarchiwizowanych plików
ru: Не удалось получить список архивных файлов

source: Unable to open archive %s: %s
es: No se puede abrir el archivo %s: %s
fr: Impossible d'ouvrir l'archive %s: %s
pl: Nie można otworzyć archiwum %s: %s
ru: Не удалось открыть архив %s: %s

source: File %filename% (size: %filesize%) has been skipped during backup.
es: El archivo %filename% (tamaño: %filesize%) ha sido omitido durante la copia de seguridad.
fr: Le fichier %filename% (taille : %filesize%) a été ignoré pendant la sauvegarde.
pl: Plik %filename% (rozmiar: %filesize%) został pominięty podczas tworzenia kopii zapasowej.
ru: Файл %filename% (размер: %filesize%) пропущен при резервном копировании.

source: Both 'xml' and 'zip' files attributes must be provided to use the local channel.
es: Se deben proporcionar los atributos de archivo 'XML' y 'ZIP' para utilizar el canal local.
fr: Les attributs des fichiers « xml » et « zip » doivent être fournis pour utiliser le canal local.
pl: Aby korzystać z kanału lokalnego, należy podać atrybuty plików „xml” i „zip”.
ru: Для использования локального канала необходимо указать атрибуты файлов ".xml" и ".zip".

source: File %s does not exist. Unable to select that channel.
es: El archivo %s no existe. No se puede seleccionar ese canal.
fr: Le fichier %s n'existe pas. Impossible de sélectionner ce canal.
pl: Plik %s nie istnieje. Nie można wybrać tego kanału.
ru: файл %s не существует. Невозможно выбрать данный канал.

source: We couldn't find a PrestaShop version in the XML file that was uploaded in your local archive. Please try again.
es: No pudimos encontrar una versión de PrestaShop en el archivo XML que se cargó en su archivo local. Inténtelo nuevamente.
fr: Nous n'avons pas pu trouver de version de PrestaShop dans le fichier XML téléchargé dans vos archives locales. Veuillez réessayer.
pl: Nie udało się znaleźć wersji PrestaShop w pliku XML przesłanym do lokalnego archiwum. Spróbuj ponownie.
ru: Не удалось найти версию PrestaShop в XML-файле, загруженном в локальный архив. Повторите попытку.

source: The PrestaShop version in your archive doesn't match the one in XML file. Please fix this issue and try again.
es: La versión de PrestaShop en tu archivo no coincide con la del archivo XML. Soluciona el problema y vuelve a intentarlo.
fr: La version de PrestaShop dans votre archive ne correspond pas à celle du fichier XML. Veuillez résoudre ce problème et réessayer.
pl: Wersja PrestaShop w Twoim archiwum jest inna niż wersja w pliku XML. Rozwiąż ten problem i spróbuj ponownie.
ru: Версия PrestaShop в архиве не соответствует версии в XML-файле. Исправьте эту проблему и повторите попытку.

source: Unknown channel %s
es: Canal desconocido %s
fr: Canal %s inconnu
pl: Nieznany kanał %s
ru: Неизвестный канал %s

source: No zip archive provided
es: No se proporcionó ningún archivo ZIP
fr: Aucune archive zip fournie
pl: Nie podano archiwum ZIP
ru: ZIP-архив не предоставлен

source: No xml archive provided
es: No se proporcionó ningún archivo XML
fr: Aucune archive xml fournie
pl: Nie podano archiwum XML
ru: XML-архив не предоставлен

source: Value must be a boolean for %s
es: El valor debe ser un booleano para %s
fr: La valeur doit être un booléen pour %s
pl: Wartość musi być wartością logiczną dla: %s
ru: Значение %s должно быть логическим

source: Invalid configuration, backup name is missing.
es: Configuración no válida, falta el nombre de la copia de seguridad.
fr: Configuration non valide, le nom de sauvegarde est manquant.
pl: Nieprawidłowa konfiguracja, brakuje nazwy kopii zapasowej.
ru: Недопустимая конфигурация, отсутствует имя резервной копии.

source: Invalid configuration, backup %s doesn't exist.
es: Configuración no válida, la copia de seguridad %s no existe.
fr: Configuration non valide, la sauvegarde %s n'existe pas.
pl: Nieprawidłowa konfiguracja, kopia zapasowa %s nie istnieje.
ru: Недопустимая конфигурация, резервная копия %s не существует.

source: Unable to create directory %s: %s
es: No se puede crear el directorio %s: %s
fr: Impossible de créer le répertoire %s: %s
pl: Nie można utworzyć katalogu %s: %s
ru: Не удалось создать каталог %s: %s

source: Cannot write to the directory. Please ensure you have the necessary write permissions on "%s".
es: No se puede escribir en el directorio. Asegúrate de tener los permisos de escritura necesarios en "%s".
fr: Impossible d'écrire dans le répertoire. Veuillez vous assurer que vous disposez des autorisations d'écriture nécessaires sur «%s».
pl: Nie można zapisać danych w katalogu. Upewnij się, że masz niezbędne uprawnienia do zapisu w „%s”.
ru: Не удается выполнить запись в каталог. Убедитесь, что у вас есть необходимые разрешения на запись в каталог "%s".

source: Download attempt %d/%d failed: %s
es: Intento de descarga %d/%d fallido: %s
fr: Échec de la tentative de téléchargement %d/%d : %s
pl: Niepowodzenie próby pobrania %d/%d: %s
ru: Попытка скачивания %d/%d, неудачно: %s

source: All download attempts have failed.
es: Todos los intentos de descarga han fallado.
fr: Toutes les tentatives de téléchargement ont échoué.
pl: Wszystkie próby pobrania się nie powiodły.
ru: Все попытки скачивания завершились неудачно.

source: The file could not be downloaded or is empty. Destination path: "%s", Source URL: "%s".
es: El archivo no se pudo descargar o está vacío. Ruta de destino: "%s", URL de origen: "%s".
fr: Le fichier n'a pas pu être téléchargé ou est vide. Chemin de destination : « %s », URL source : « %s ».
pl: Nie można pobrać pliku lub jest on pusty. Ścieżka docelowa: „%s”, źródłowy adres URL: „%s”.
ru: Не удалось скачать файл или он пуст. Путь назначения: "%s", URL-адрес источника: "%s".

source: Error when retrieving data from Distribution API
es: Error al recuperar datos de la API de distribución
fr: Erreur lors de la récupération des données de l'API de Distribution

source: No version match in Distribution api for %s
es: No hay coincidencia de versión en la API de distribución para %s
fr: Aucune version correspondante dans l'Api de distribution pour %s
pl: Brak pasującej wersji w interfejsie API dystrybucji dla: %s
ru: В API дистрибуции нет соответствующей версии для %s

source: Download backup logs
es: Descargar registros de copias de seguridad
fr: Télécharger les logs de sauvegarde
pl: Pobierz dzienniki kopii zapasowej
ru: Скачать журналы резервного копирования

source: Download restore logs
es: Descargar registros de restauración
fr: Télécharger les logs de restauration
pl: Pobierz dzienniki przywracania
ru: Скачать журналы восстановления

source: Download update logs
es: Descargar registros de actualización
fr: Télécharger les logs de mise à jour
pl: Pobierz dzienniki aktualizacji
ru: Скачать журналы обновлений

source: An error occurred while formatting the backup name.
es: Se produjo un error al formatear el nombre de la copia de seguridad.
fr: Une erreur s'est produite lors du formatage du nom de la sauvegarde.
pl: Podczas formatowania nazwy kopii zapasowej wystąpił błąd.
ru: Произошла ошибка при форматировании имени резервной копии.

source: Backup requested for deletion does not exist.
es: La copia de seguridad solicitada para su eliminación no existe.
fr: La sauvegarde demandée pour la suppression n'existe pas.
pl: Kopia zapasowa, która ma zostać usunięta, nie istnieje.
ru: Резервная копия, запрошенная для удаления, не существует.

source: Your current PHP version isn't compatible with PrestaShop %s. (Expected: %s - %s | Current: %s)
es: Tu versión actual de PHP no es compatible con PrestaShop %s. (Esperado: %s - %s | Actual: %s)
fr: Votre version PHP actuelle n'est pas compatible avec PrestaShop %s. (Attendu : %s - %s | Actuel : %s)
pl: Używana przez Ciebie wersja PHP nie jest zgodna z PrestaShop %s. (Oczekiwana wersja: %s–%s | Obecna wersja: %s)
ru: Текущая версия PHP несовместима с PrestaShop %s. (Требуется: %s — %s | Текущая: %s)

source: Your store's root directory %s isn't writable. Provide write access to the user running PHP with appropriate permission & ownership.
es: El directorio raíz de tu tienda %s no tiene permisos de escritura. Proporciona acceso de escritura al usuario que ejecuta PHP con el permiso y la propiedad apropiados.
fr: Le répertoire racine de votre boutique %s n'est pas accessible en écriture. Donnez un accès en écriture à l'utilisateur exécutant PHP avec les autorisations et permissions appropriées.
pl: Katalog główny Twojego sklepu %s nie jest dostępny do zapisu. Przyznaj dostęp do zapisu użytkownikowi uruchamiającemu PHP, nadając mu odpowiednie uprawnienia i prawa własności.
ru: Корневой каталог %s вашего магазина недоступен для записи. Предоставьте пользователю, работающему с PHP, доступ с правом записи, а также соответствующие разрешения и права владения.

source: The %s directory isn't writable. Provide write access to the user running PHP with appropriate permission & ownership.
es: El directorio %s no tiene permisos de escritura. Proporciona acceso de escritura al usuario que ejecuta PHP con el permiso y la propiedad apropiados.
fr: Le répertoire racine de votre boutique %s n'est pas accessible en écriture. Donnez un accès en écriture à l'utilisateur exécutant PHP avec les autorisations et permissions appropriées.
pl: Katalog %s nie jest dostępny do zapisu. Przyznaj dostęp do zapisu użytkownikowi uruchamiającemu PHP, nadając mu odpowiednie uprawnienia i prawa własności.
ru: Каталог %s недоступен для записи. Предоставьте пользователю, работающему с PHP, доступ с правом записи, а также соответствующие разрешения и права владения.

source: Files can't be downloaded. Enable PHP's "allow_url_fopen" option or install PHP extension "cURL".
es: No se pueden descargar archivos. Activa la opción "allow_url_fopen" de PHP o instala la extensión "cURL" de PHP.
fr: Les fichiers ne peuvent pas être téléchargés. Activez l'option PHP « allow_url_fopen » ou installez l'extension PHP « cURL ».
pl: Nie można pobrać plików. Włącz opcję PHP „allow_url_fopen” lub zainstaluj rozszerzenie PHP „cURL”.
ru: Не удается скачать файлы. Включите параметр PHP "allow_url_fopen" или установите PHP-расширение "cURL".

source: Missing PHP extension "zip".
es: Falta la extensión PHP "zip".
fr: L'extension PHP "zip" est manquante.
pl: Brak rozszerzenia PHP „zip”.
ru: Отсутствует PHP-расширение "zip".

source: Maintenance mode needs to be enabled. Enable maintenance mode and add your maintenance IP in [1]Shop parameters > General > Maintenance[/1].
es: El modo de mantenimiento debe estar habilitado. Activa el modo mantenimiento y añade tu IP de mantenimiento en [1]Parámetros de la tienda > General > Mantenimiento[/1].
fr: Le mode maintenance doit être activé. Activez ce mode et ajoutez votre adresse IP de maintenance dans [1]Paramètres de la boutique > Général > Maintenance[/1].
pl: Tryb konserwacji musi być włączony. Włącz tryb konserwacji i dodaj adres IP konserwacji w sekcji [1] Parametry sklepu > Ogólne > Konserwacja[/1].
ru: Необходимо включить режим обслуживания. Включите режим обслуживания и добавьте свой IP-адрес обслуживания в разделе [1]Параметры магазина > Общие > Обслуживание[/1].

source: PrestaShop's caching features needs to be disabled. Disable caching features in [1]Advanced parameters > Performance > Caching[/1].
es: Es necesario desactivar las funciones de caché de PrestaShop. Desactívalas en [1]Parámetros avanzados > Rendimiento > Almacenamiento en caché[/1].
fr: Les fonctionnalités de mise en cache de PrestaShop doivent être désactivées. Désactivez les fonctionnalités de mise en cache dans [1]Paramètres avancés > Performances > Mise en cache[/1].
pl: Funkcje buforowania PrestaShop muszą być wyłączone. Wyłącz funkcje buforowania w sekcji [1]Parametry zaawansowane > Wydajność > Buforowanie[/1].
ru: Необходимо отключить функции кэширования PrestaShop. Отключите функции кэширования в разделе [1]Дополнительные параметры > Производительность > Кэширование[/1].

source: PHP's max_execution_time setting needs to have a high value or needs to be disabled entirely (current value: %s seconds).
es: La configuración max_execution_time de PHP debe tener un valor alto o debe deshabilitarse por completo (valor actual: %s segundos).
fr: Le paramètre max_execution_time de PHP doit avoir une valeur élevée ou doit être entièrement désactivé (valeur actuelle : %s secondes).
pl: Ustawienie PHP max_execution_time musi mieć dużą wartość lub musi być całkowicie wyłączone (aktualna wartość: %s s).
ru: Параметр PHP "max_execution_time" должен иметь высокое значение или быть полностью отключен (текущее значение: %s секунд).

source: Apache mod_rewrite needs to be enabled.
es: Apache mod_rewrite necesita estar habilitado.
fr: Apache mod_rewrite doit être activé.
pl: Moduł mod_rewrite serwera Apache musi być włączony.
ru: Необходимо включить "Apache mod_rewrite".

source: The following PHP extensions need to be installed:
es: Es necesario instalar las siguientes extensiones PHP:
fr: Les extensions PHP suivantes doivent être installées :
pl: Należy zainstalować następujące rozszerzenia PHP:
ru: Необходимо установить следующие расширения PHP:

source: The following PHP functions need to be allowed:
es: Se deben permitir las siguientes funciones PHP:
fr: Les fonctions PHP suivantes doivent être autorisées :
pl: Należy zezwolić na następujące funkcje PHP:
ru: Необходимо разрешить следующие функции PHP:

source: PHP memory_limit needs to be greater than 256 MB.
es: El límite de memoria de PHP debe ser superior a 256 MB.
fr: PHP memory_limit doit être supérieur à 256 Mo.
pl: Wartość parametru PHP memory_limit musi być większa niż 256 MB.
ru: Параметр "PHP memory_limit" должен иметь значение больше 256 МБ.

source: PHP file_uploads configuration needs to be enabled.
es: Es necesario habilitar la configuración de file_uploads de PHP.
fr: La configuration PHP file_uploads doit être activée.
pl: Opcja PHP file_uploads musi być włączona.
ru: Необходимо включить конфигурацию PHP "file_uploads".

source: Failed to generate private keys using openssl_pkey_new(). Please check your PHP configuration, especially the openssl.cafile setting, and ensure that the specified file exists and is accessible.
es: No se pudieron generar claves privadas con openssl_pkey_new(). Revise su configuración de PHP, especialmente la configuración de openssl.cafile, y asegúrese de que el archivo especificado exista y sea accesible.
fr: Échec de la génération des clés privées avec openssl_pkey_new(). Veuillez vérifier votre configuration PHP, en particulier le paramètre openssl.cafile, et vous assurer que le fichier spécifié existe et est accessible.

source: It's not possible to write in the following folders. Provide write access to the user running PHP with appropriate permission & ownership:
es: No es posible escribir en las siguientes carpetas. Otorga acceso de escritura al usuario que ejecuta PHP con los permisos y la propiedad adecuados:
fr: Il n'est pas possible d'écrire dans les dossiers suivants. Donnez un accès en écriture à l'utilisateur exécutant PHP avec les autorisations et les permissions appropriées :
pl: Danych nie można zapisać w następujących folderach. Przyznaj dostęp do zapisu użytkownikowi uruchamiającemu PHP, nadając mu odpowiednie uprawnienia i prawa własności:
ru: Не удается выполнить запись в следующие папки. Предоставьте пользователю, работающему с PHP, доступ с правом записи, а также соответствующие разрешения и права владения.

source: The version of PrestaShop does not match the one stored in database. Your database structure may not be up-to-date and/or the value of PS_VERSION_DB needs to be updated in the configuration table.
es: La versión de PrestaShop no coincide con la almacenada en la base de datos. Su estructura de base de datos puede no estar actualizada y/o el valor de PS_VERSION_DB necesita ser actualizado en la tabla de configuración.
fr: La version de PrestaShop ne correspond pas à celle stockée dans la base de données. La structure de votre base de données n'est peut-être pas à jour et/ou la valeur de PS_VERSION_DB doit être mise à jour dans la table de configuration.
pl: Wersja PrestaShop jest niezgodna z wersją zapisaną w bazie danych. Struktura bazy danych może nie być aktualna i/lub wartość PS_VERSION_DB musi zostać zaktualizowana w tabeli konfiguracji.
ru: Версия PrestaShop не соответствует версии, которая хранится в базе данных. Возможно, ваша структура базы данных устарела, и (или) необходимо обновить значение "PS_VERSION_DB" в таблице конфигурации.

source: Updates to this PrestaShop version are not officially supported by the Update Assistant module.
es: Las actualizaciones de esta versión de PrestaShop no son compatibles oficialmente con el módulo Update Assistant.
fr: Les mises à jour vers cette version de PrestaShop ne sont pas officiellement supportées par le module Update Assistant.

source: Your current version of the module is out of date. Update now [1]Modules > Module Manager > Updates[/1]
es: Tu versión actual del módulo no está actualizada. Actualízala ahora [1]Módulos > Administrador de módulos > Actualizaciones[/1]
fr: Votre version actuelle du module est obsolète. Mettez à jour maintenant [1]Modules > Gestionnaire de modules > Mises à jour[/1]
pl: Bieżąca wersja modułu jest nieaktualna. Zaktualizuj go teraz: [1]Moduły > Menedżer modułów > Aktualizacje[/1].
ru: Текущая версия модуля устарела. Обновить сейчас [1]Модули > Диспетчер модулей > Обновления[/1]

source: We were unable to check your PHP compatibility with PrestaShop %s.
es: No pudimos comprobar tu compatibilidad de PHP con PrestaShop %s.
fr: Nous n'avons pas pu vérifier votre compatibilité PHP avec PrestaShop %s.
pl: Nie można sprawdzić zgodności Twojej instalacji PHP z PrestaShop %s.
ru: Не удалось проверить совместимость PHP с PrestaShop %s.

source: Some core files have been altered or removed. Any changes made to these files may be overwritten during the update. [1]See the list of changes[/1].
es: Se han modificado o eliminado algunos archivos principales. Cualquier cambio realizado en estos archivos podría sobrescribirse durante la actualización. [1]Consulta la lista de cambios[/1].
fr: Certains fichiers du core ont été modifiés ou supprimés. Toute modification apportée à ces fichiers peut être écrasée lors de la mise à jour. [1]Voir la liste des modifications.[/1].

source: Some core files have been altered or removed. Any changes made to these files may be overwritten during the update.
es: Se han modificado o eliminado algunos archivos principales. Cualquier cambio realizado en estos archivos podría sobrescribirse durante la actualización.
fr: Certains fichiers du core ont été modifiés ou supprimés. Toute modification apportée à ces fichiers peut être écrasée lors de la mise à jour.
pl: Niektóre pliki podstawowe zostały zmienione lub usunięte. Wszelkie zmiany wprowadzone w tych plikach mogą zostać zastąpione podczas aktualizacji.
ru: Некоторые основные файлы были изменены или удалены. Любые изменения, внесенные в эти файлы, могут быть перезаписаны во время обновления.

source: Some theme files have been altered or removed. Any changes made to these files may be overwritten during the update. [1]See the list of changes[/1].
es: Se han modificado o eliminado algunos archivos de tema. Cualquier cambio realizado en estos archivos podría sobrescribirse durante la actualización. [1]Consulta la lista de cambios[/1].
fr: Certains fichiers du thème ont été modifiés ou supprimés. Toute modification apportée à ces fichiers peut être écrasée lors de la mise à jour. [1]Voir la liste des modifications.[/1].

source: Some theme files have been altered or removed. Any changes made to these files may be overwritten during the update.
es: Se han modificado o eliminado algunos archivos de tema. Cualquier cambio realizado en estos archivos podría sobrescribirse durante la actualización.
fr: Certains fichiers du thème ont été modifiés ou supprimés. Toute modification apportée à ces fichiers peut être écrasée lors de la mise à jour.
pl: Niektóre pliki motywów zostały zmienione lub usunięte. Wszelkie zmiany wprowadzone w tych plikach mogą zostać zastąpione podczas aktualizacji.
ru: Некоторые файлы темы были изменены или удалены. Любые изменения, внесенные в эти файлы, могут быть перезаписаны во время обновления.

source: We were unable to fetch missing or altered files. In these conditions, your store cannot be updated to avoid any further bugs.
es: No se han podido recuperar los archivos que faltan o se modificaron. En estas circunstancias, tu tienda no se puede actualizar para evitar más bugs.
fr: Nous n'avons pas pu récupérer les fichiers manquants ou modifiés. Dans ces conditions et afin d'éviter d'autres bugs, votre boutique ne peut pas être mise à jour.

source: Unknown requirement.
es: Requisito desconocido.
fr: Pré-requis inconnu.
pl: Nieznane wymaganie.
ru: Неизвестное требование.

source: Backup selection
es: Selección de copia de seguridad
fr: Sélection de sauvegarde
pl: Wybór kopii zapasowej
ru: Выбор резервной копии

source: Restore
es: Restaurar
fr: Restauration
pl: Przywracanie
ru: Восстановление

source: Post-restore
es: Post-restauración
fr: Post-restauration
pl: Po przywróceniu
ru: После восстановления

source: Version choice
es: Elección de versión
fr: Choix de la version
pl: Wybór wersji
ru: Выбор версии

source: Update options
es: Opciones de actualización
fr: Options de mise à jour
pl: Opcje aktualizacji
ru: Обновить параметры

source: Update
es: Actualizar
fr: Mise à jour
pl: Aktualizacja
ru: Обновление

source: Post-update
es: Post-actualización
fr: Post-mise à jour
pl: Po aktualizacji
ru: После обновления

source: Unable to create the directory "%s"
es: No se puede crear el directorio "%s"
fr: Impossible de créer le dossier "%s"
pl: Nie można utworzyć katalogu "%s"
ru: Невозможно создать директорию "%s"

source: Unable to write in the directory "%s"
es: No se puede escribir en el directorio "%s"
fr: Impossible d'écrire dans le dossier "%s"
pl: Nie można zapisywać w katalogu "%s"
ru: Запись в директорию "%s" невозможна

source: The module %s requires PHP %s to work properly. Please upgrade your server configuration.
es: El módulo %s requiere PHP %s para funcionar correctamente. Actualiza la configuración de tu servidor.
fr: Le module %s nécessite PHP %s pour fonctionner correctement. Veuillez mettre à niveau la configuration de votre serveur.
pl: Moduł %s wymaga PHP w wersji %s do prawidłowego działania. Zaktualizuj konfigurację serwera.
ru: Для правильной работы модуля %s требуется PHP %s. Обновите конфигурацию сервера.

source: Major version
es: Versión principal
fr: Version majeure
pl: Wersja główna
ru: Основной номер версии

source: Minor version
es: Versión menor
fr: Version mineure
pl: Wersja poboczna
ru: Дополнительный номер версии
