Repository: pixelandbrick/sheridantools-prestashop
Catalog: modules/autoupgrade/translations/ModulesAutoupgradeAdmin.*.xlf
Languages: es, fr, pl, ru

source: Checking version validity
es: Comprobando la validez de la versión
fr: Vérification de la validité de la version
pl: Sprawdzanie poprawności wersji
ru: Проверка достоверности версии

source: Disabling all non native modules
es: Deshabilitando todos los módulos no nativos
fr: Désactiver les modules non natifs
pl: Wyłączanie wszystkich modułów innych niż natywne
ru: Отключение всех сторонних модулей

source: Keeping non native modules enabled
es: Manteniendo los módulos no nativos habilitados
fr: Garder les modules non natifs activés
pl: Zachowywanie włączonych modułów innych niż natywne
ru: Сторонние модули останутся включенными

source: Version to install is too old. Current version: %oldversion%. Version to install: %newversion%.
es: La versión a instalar es demasiado antigua. Versión actual: %oldversion%. Versión a instalar: %newversion%.
fr: La version à installer est trop ancienne. Version actuelle : %oldversion%. Version à installer : %newversion%.
pl: Wersja do zainstalowania jest zbyt stara. Bieżąca wersja: %oldversion%. Wersja do zainstalowania: %newversion%.
ru: Устанавливаемая версия устарела. Текущая версия: %oldversion%. Устанавливаемая версия: %newversion%.

source: You already have the %s version.
es: Ya tienes la versión %s.
fr: Vous êtes déjà en possession de la version %s
pl: Masz już wersję %s.
ru: У вас уже установлена %s версия.

source: The database has been cleaned.
es: La base de datos ha sido limpiada.
fr: La base de données a été nettoyée.
pl: Baza danych została wyczyszczona.
ru: База данных очищена.

source: You need allow_url_fopen or cURL enabled for automatic download to work. You can also manually upload it in filepath %s.
es: Necesitas activar allow_url_fopen o cURL para realizar descargas automáticas. También puedes subirlo manualmente en la ruta %s.
fr: Vous devez activer "allow_url_fopen" ou cURL pour que le téléchargement automatique fonctionne. Vous pouvez également mettre le fichier en ligne dans le chemin de fichier %s.
pl: Aby automatyczne pobieranie działało, musisz włączyć allow_url_fopen lub cURL. Możesz również ręcznie przesłać plik do ścieżki %s.
ru: Вы должны включить allow_url_fopen или cURL для работы автоматической загрузки. Также возможна ручная загрузка файлов в %s.

source: Downloading from %s
es: Descargando desde %s
fr: Téléchargement depuis %s
pl: Pobieranie z %s
ru: Загрузка из %s

source: File will be saved in %s
es: El archivo será guardado en %s
fr: Le fichier sera enregistré dans %s
pl: Plik zostanie zapisany w %s
ru: Файл будет сохранён в %s

source: Download directory has been emptied
es: El directorio download ha sido vaciado
fr: Le dossier de téléchargement a été vidé.
pl: Katalog pobierania został opróżniony
ru: Директория загрузок очищена

source: Download directory %s is not writable.
es: El directorio de descarga %s no tiene permisos de escritura.
fr: Impossible d'écrire dans le dossier de téléchargement %s.
pl: Katalog pobierania %s nie jest zapisywalny.
ru: Невозможна запись в директорию загрузок %s.

source: Download complete. Now extracting...
es: Descarga completada. Extracción en curso...
fr: Téléchargement terminé. Extraction...
pl: Pobieranie ukończone. Teraz rozpakowywanie...
ru: Загрузка завершена. Идет распаковка...

source: Download complete but MD5 sum does not match (%s).
es: Descarga completada, pero la suma MD5 no coincide (%s).
fr: Téléchargement terminé, mais le calcul MD5 ne correspond pas (%s).
pl: Pobieranie ukończone, ale suma MD5 się nie zgadza (%s).
ru: Загрузка завершена, однако суммы MD5 не совпадают (%s).

source: The .zip archive could not be downloaded. The update is currently impossible. Please try again later.
es: No se pudo descargar el archivo .zip. La actualización no es posible en este momento. Inténtalo de nuevo más tarde.
fr: L'archive .zip n'a pas pu être téléchargée. La mise à jour est actuellement impossible. Veuillez réessayer ultérieurement.
pl: Nie można pobrać pliku ZIP archiwum. Aktualizacja jest obecnie niemożliwa. Spróbuj ponownie później.
ru: Не удалось скачать ZIP-архив. В настоящее время обновление невозможно. Повторите попытку позже.

source: Unknown configuration key '%s', Ignoring.
es: Clave de configuración desconocida '%s', Ignorando.
fr: Clé de configuration inconnue '%s', ignorée.

source: Update process will use archive.
es: El proceso de actualización utilizará el archivo.
fr: Le processus de mise à jour utilisera l'archive.
pl: Proces aktualizacji będzie korzystał z archiwum.
ru: В процессе обновления будет использоваться архив.

source: We couldn't find a PrestaShop version in the .zip file that was uploaded in your local archive. Please try again.
es: No se pudo encontrar la versión de PrestaShop en el archivo .zip que subiste a tu archivo local. Inténtalo de nuevo.
fr: Nous n'avons pas pu trouver de version de PrestaShop dans le fichier .zip téléchargé dans vos archives locales. Veuillez réessayer.
pl: Nie udało się znaleźć wersji PrestaShop w pliku ZIP przesłanym do lokalnego archiwum. Spróbuj ponownie.
ru: Не удалось найти версию PrestaShop в ZIP-файле, загруженном в локальный архив. Повторите попытку.

source: Error on saving configuration
es: Error al guardar la configuración
fr: Impossible de sauver la configuration.
pl: Błąd podczas zapisywania konfiguracji
ru: Ошибка при сохранении конфигурации

source: Configuration successfully updated.
es: Configuración actualizada correctamente.
fr: La configuration a bien été mise à jour.
pl: Konfiguracja zaktualizowana pomyślnie.
ru: Конфигурация обновлена.

source: API keys not present in parameters, generating
es: Claves API no presentes en los parámetros, generando
fr: Clés API non présentes dans les paramètres, générant
pl: Brak kluczy API w parametrach, generowanie
ru: Ключи API отсутствуют в параметрах, выполняется создание

source: Keys generated using openssl_pkey_new, exporting private and public keys
es: Claves generadas usando openssl_pkey_new, exportando claves privadas y públicas
fr: Clés générées en utilisant openssl_pkey_new, exportation des clés privées et publiques
pl: Klucze zostały wygenerowane za pomocą openssl_pkey_new, eksportowanie kluczy prywatnego i publicznego
ru: Ключи, созданные с помощью openssl_pkey_new, экспортируют закрытые и открытые ключи

source: Updating parameters file
es: Actualizando archivo de parámetros
fr: Mise à jour du fichier de paramètres
pl: Aktualizowanie pliku parametrów
ru: Обновление файла параметров

source: Unable to migrate parameters
es: No se pueden migrar parámetros
fr: Impossible de migrer les paramètres
pl: Nie można przenieść parametrów
ru: Не удалось перенести параметры

source: Invalidating opcache for parameters file
es: Invalidación de opcache para el archivo de parámetros
fr: Suppression des opcache pour le fichier de paramètres
pl: Unieważnianie pamięci opcache dla pliku parametrów
ru: Аннулирование кэша opcache для файла параметров

source: Parameters file updated
es: Archivo de parámetros actualizado
fr: Fichier des paramètres mis à jour
pl: Plik parametrów został zaktualizowany
ru: Файл параметров обновлен

source: Running generic queries
es: Ejecutando consultas genéricas
fr: Exécuter des requêtes génériques
pl: Uruchamianie ogólnych zapytań
ru: Запуск универсальных запросов

source: Database update OK
es: Actualización de la base de datos correcta
fr: Mise à jour de la base de données OK
pl: Aktualizacja bazy danych: OK
ru: Обновление базы данных выполнено успешно

source: Updating languages
es: Actualizando idiomas
fr: Mise à jour des langues
pl: Aktualizowanie języków
ru: Обновление языков

source: Regenerating htaccess
es: Regenerando htaccess
fr: Regénération du htaccess
pl: Ponowne generowanie pliku .htaccess
ru: Повторное создание htaccess

source: Cleaning XML files
es: Limpiando archivos XML
fr: Nettoyage des fichiers XML
pl: Czyszczenie plików XML
ru: Очистка XML-файлов

source: Keeping overrides in place
es: Manteniendo overrides
fr: Conserver les overrides en place
pl: Zachowywanie nadpisanych elementów
ru: Фиксация переопределений

source: Disabling overrides
es: Deshabilitando overrides
fr: Désactivation des overrides
pl: Wyłączanie nadpisanych elementów
ru: Отключение переопределений

source: Warning detected during update.
es: Advertencia detectada durante la actualización.
fr: Avertissement détecté lors de la mise à jour.
pl: Podczas aktualizacji wykryto ostrzeżenie.
ru: В процессе обновления обнаружено предупреждение.

source: Database update completed
es: Actualización de la base de datos completada
fr: Mise à jour de la base de données terminée
pl: Aktualizacja bazy danych ukończona
ru: Обновление базы данных завершено

source: Unable to find upgrade directory in the installation path.
es: No es posible encontrar la carpeta de actualización en la ruta de instalación.
fr: Impossible de trouver le répertoire de mise à jour "upgrade" dans le chemin d'installation.
pl: Nie można znaleźć uaktualnienia w katalogu w ścieżce instalacji.
ru: Невозможно найти директорию обновлений в установочном пути.

source: Error while loading SQL upgrade file "%s".
es: Error al cargar el archivo de actualización de SQL "%s".
fr: Erreur lors du chargement du fichier de mise à jour SQL "%s".
pl: Błąd podczas ładowania pliku aktualizacji SQL "%s".
ru: Ошибка при загрузке файла обновления SQL "%s".

source: Cannot find the SQL upgrade files. Please check that the %s folder is not empty.
es: No es posible encontrar los archivos de actualización SQL. Por favor, comprueba que la carpeta %s no esté vacía.
fr: Impossible de trouver les fichiers de mise à jour SQL. Veuillez vérifier que le dossier %s n'est pas vide.
pl: Nie można znaleźć plików aktualizacji SQL. Proszę sprawdzić, czy folder %s nie jest pusty.
ru: Невозможно найти SQL-файлы обновления. Убедитесь, что директория %s не пуста.

source: Migration file: %s, Query: %s
es: Archivo de migración: %s, Consulta: %s
fr: Fichier de migration : %s, Requête : %s
pl: Plik migracji: %s, zapytanie: %s
ru: Файл миграции: %s, запрос: %s

source: %s PHP - missing file %s
es: %s PHP - falta el archivo %s
fr: %s PHP - fichier manquant %s
pl: %s PHP – brak pliku %s
ru: %s PHP — отсутствует файл %s

source: %s PHP - Object Method call is forbidden (%s)
es: %s PHP - La llamada al método de objeto está prohibida (%s)
fr: %s PHP - L'appel de cette méthode objet est interdit (%s)
pl: %s PHP – wywołanie metody obiektu jest zabronione (%s)
ru: %s PHP — вызов метода объекта запрещен (%s)

source: SQL %s table has been dropped.
es: Se ha eliminado la tabla SQL %s.
fr: La table SQL %s a été supprimée.
pl: Tabela SQL %s została usunięta.
ru: Таблица SQL %s удалена.

source: The execution of the query failed: %s, %s
es: La ejecución de la consulta falló: %s, %s
fr: L'exécution de la requête a échoué : %s, %s
pl: Nie udało się wykonać zapytania: %s, %s
ru: Ошибка выполнения запроса: %s, %s

source: The execution of the query failed: %s, %s. This error code can be safely ignored.
es: La ejecución de la consulta falló: %s, %s. Este código de error se puede ignorar sin problemas.
fr: L'exécution de la requête a échoué : %s, %s. Ce code d'erreur peut être ignoré en toute sécurité.
pl: Nie udało się wykonać zapytania: %s, %s. Ten kod błędu można bezpiecznie zignorować.
ru: Ошибка выполнения запроса: %s, %s. Этот код ошибки можно игнорировать.

source: Keeping current theme
es: Mantener el tema actual
fr: Garder le thème actuel
pl: Zachowywanie aktualnego motywu
ru: Сохранение текущей темы

source: Switching to default theme.
es: Cambiando al tema predeterminado.
fr: Retour au thème par défaut.
pl: Przełączam się na motyw domyślny.
ru: Переключение на тему по умолчанию.

source: No RTL language detected, skipping RTL file update.
es: No se detectó ningún idioma RTL, se omite la actualización del archivo RTL.
fr: Aucune langue RTL détectée, mise à jour du fichier RTL ignorée.
pl: Nie wykryto języka RTL, pomijanie aktualizacji plików RTL.
ru: Язык RTL не обнаружен, обновление RTL-файла пропущено.

source: Update the RTL files of back-office themes.
es: Actualizar los archivos RTL de los temas del back-office.
fr: Mise à jour des fichiers RTL des thèmes back-office.
pl: Zaktualizuj pliki RTL motywów back office.
ru: Обновите RTL-файлы тем рабочего кабинета.

source: Update the RTL files of front-office themes.
es: Actualizar los archivos RTL de temas de front-office.
fr: Mise à jour des fichiers RTL des thèmes front-office.
pl: Zaktualizuj pliki RTL motywów front office.
ru: Обновите RTL-файлы тем раздела для работы с клиентами.

source: PHP Impossible to generate RTL files for theme %s: %s
es: PHP Imposible generar archivos RTL para el tema %s: %s
fr: PHP Impossible de générer des fichiers RTL pour le thème %s : %s
pl: PHP: Nie można wygenerować plików RTL dla motywu %s: %s
ru: PHP: невозможно создать RTL-файлы для темы %s: %s

source: An error was raised when warming up the core cache: %s
es: Se produjo un error al calentar la caché del núcleo: %s
fr: Une erreur s'est produite lors du préchargement du cache core : %s
pl: Podczas przygotowywania podstawowej pamięci podręcznej wystąpił błąd: %s
ru: При прогреве основного кэша возникла ошибка: %s

source: Core cache has been generated to avoid dependency conflicts.
es: Se ha generado la caché del núcleo para evitar conflictos de dependencias.
fr: Le cache du core a été généré pour éviter les conflits de dépendances.
pl: Podstawowa pamięć podręczna została wygenerowana, aby uniknąć konfliktów zależności.
ru: Основной кэш создан во избежание конфликтов зависимостей.

source: %lang% is not a valid iso code, skipping
es: %lang% no es un código ISO válido, se omite
fr: %lang% n'est pas un code iso valide, ignoré
pl: %lang% nie jest prawidłowym kodem ISO, pomijanie
ru: %lang% не является допустимым кодом ISO и будет пропущен

source: Download of the language pack %lang% failed. %details%
es: La descarga del paquete de idioma %lang% falló. %details%
fr: Le téléchargement du pack de langue %lang% a échoué. %details%
pl: Pobieranie pakietu językowego %lang% nie powiodło się. %details%
ru: Не удалось загрузить языковой пакет %lang%. %details%

source: Error while updating translations for the language pack %lang%. %details%
es: Error al actualizar las traducciones del paquete de idioma %lang%. %details%
fr: Erreur lors de la mise à jour des traductions pour le pack de langue %lang%. %details%
pl: Błąd podczas aktualizowania tłumaczeń pakietu językowego: %lang%. %details%
ru: Ошибка при обновлении переводов для языкового пакета %lang%. %details%

source: Downloading language pack for %lang%
es: Descargando paquete de idioma para %lang%
fr: Téléchargement du pack de langue pour %lang%
pl: Pobieranie pakietu językowego: %lang%
ru: Загрузка языкового пакета для %lang%

source: Installing %lang% language pack
es: Instalando el paquete de idioma %lang%
fr: Installation du pack de langue %lang%
pl: Instalowanie pakietu językowego: %lang%
ru: Установка языкового пакета %lang%

source: Generating mail templates for %lang%
es: Generando plantillas de correo para %lang%
fr: Génération des modèles d'e-mail pour %lang%
pl: Generowanie szablonów wiadomości e-mail w języku: %lang%
ru: Создание шаблонов сообщений для %lang%

source: Cannot generate email templates: %s.
es: No se pueden generar plantillas de email: %s.
fr: Impossible de générer les modèles d'e-mail : %s.
pl: Nie można wygenerować szablonów wiadomości e-mail: %s.
ru: Невозможно создать шаблоны email: %s.

source: Error when trying to extract module %s.
es: Error al intentar extraer el módulo %s.
fr: Erreur lors de la tentative d'extraction du module %s.
pl: Błąd podczas próby wyodrębnienia modułu %s.
ru: Ошибка при попытке извлечь модуль %s.

source: No version present in database for module %s, all files for update will be applied.
es: No hay ninguna versión presente en la base de datos para el módulo %s, se aplicarán todos los archivos para actualizar.
fr: Aucune version présente dans la base de données pour le module %s, tous les fichiers de mise à jour seront appliqués.
pl: Brak wersji w bazie danych dla modułu %s. Zostaną zastosowane wszystkie pliki aktualizacji.
ru: В базе данных нет версии для модуля %s, будут применены все файлы для обновления.

source: (%s/%s) Applying migration file %s.
es: (%s/%s) Aplicando archivo de migración %s.
fr: (%s/%s) Application du fichier de migration %s.
pl: (%s/%s) Stosowanie pliku migracji %s.
ru: (%s/%s) Применение файла миграции %s.

source: Migration failed while running the file %s. Module %s disabled.
es: Error en la migración al ejecutar el archivo %s. Módulo %s deshabilitado.
fr: La migration a échoué lors de l'exécution du fichier %s. Le module %s est désactivé.
pl: Migracja nie powiodła się podczas uruchamiania pliku %s. Moduł %s jest wyłączony.
ru: Ошибка миграции при запуске файла %s. Модуль %s отключен.

source: Unexpected issue when trying to upgrade module %s. Module %s disabled.
es: Problema inesperado al intentar actualizar el módulo %s. Módulo %s deshabilitado.
fr: Problème inattendu lors de la tentative de mise à jour du module %s. Module %s désactivé.
pl: Nieoczekiwany problem podczas próby uaktualnienia modułu %s. Moduł %s jest wyłączony.
ru: Неожиданная проблема при попытке обновить модуль %s. Модуль %s отключен.

source: Module %s version could not be updated. Database might be unavailable.
es: No se pudo actualizar la versión del módulo %s . La base de datos podría no estar disponible.
fr: La version du module %s n'a pas pu être mise à jour. La base de données n'est peut-être pas disponible.
pl: Nie można zaktualizować wersji modułu %s. Baza danych może być niedostępna.
ru: Не удалось обновить версию модуля %s. Возможно, база данных недоступна.

source: Method %s does not exist. Module %s disabled.
es: El método %s no existe. El módulo %s está deshabilitado.
fr: La méthode %s n'existe pas. Le module %s est désactivé.
pl: Metoda %s nie istnieje. Moduł %s jest wyłączony.
ru: Метод %s не существует. Модуль %s отключен.

source: Could not write temporary file %s.
es: No se pudo escribir el archivo temporal %s.
fr: Impossible d'écrire le fichier temporaire %s.
pl: Nie można zapisać pliku tymczasowego %s.
ru: Не удалось записать временный файл %s.

source: %dir% does not exist or is not a directory.
es: %dir% no existe o no es un directorio.
fr: %dir% n'existe pas ou n'est pas un répertoire.
pl: Katalog %dir% nie istnieje lub nie jest katalogiem.
ru: %dir% не существует или не является каталогом.

source: %s does not exist or is not a directory.
es: %s no existe o no es un directorio.
fr: %s n'existe pas ou n'est pas un répertoire.
pl: %s nie istnieje lub nie jest katalogiem.
ru: %s не существует или не является каталогом.

source: Download of source #%s has failed.
es: La descarga de la fuente n.°%s ha fallado.
fr: Le téléchargement de la source #%s a échoué.
pl: Pobieranie źródła nr %s się nie powiodło.
ru: Не удалось скачать исходный модуль #%s.

source: All download attempts have failed. The module %s has been disabled. You can try to update it manually afterwards.
es: Todos los intentos de descarga han fallado. El módulo %s ha sido deshabilitado. Puedes intentar actualizarlo manualmente después.
fr: Toutes les tentatives de téléchargement ont échoué. Le module %s a été désactivé. Vous pouvez essayer de le mettre à jour manuellement par la suite.
pl: Wszystkie próby pobrania się nie powiodły. Moduł %s został wyłączony. Możesz później spróbować zaktualizować go ręcznie.
ru: Все попытки скачивания завершились неудачно. Модуль %s отключен. Можно попробовать обновить его вручную.

source: Module %s update files (%s => %s) have been fetched from %s.
es: Los archivos de actualización del módulo %s (%s => %s) se han obtenido de %s.
fr: Les fichiers de mise à jour du module %s (%s => %s) ont été récupérés à partir de %s.
pl: Pliki aktualizacji modułu %s (%s => %s) zostały pobrane z: %s.
ru: Файлы обновления модуля %s (%s=> %s) извлечены из %s.

source: The received module archive is empty.
es: El archivo del módulo recibido está vacío.
fr: L'archive du module reçu est vide.
pl: Otrzymane archiwum modułu jest puste.
ru: Полученный архив модуля пуст.

source: Invalid contents from provider (Got an XML file).
es: Contenido no válido del proveedor (Obtuvo un archivo XML).
fr: Contenu invalide du provider (Fichier XML).
pl: Nieprawidłowa treść od dostawcy (otrzymano plik XML).
ru: Недопустимое содержимое от поставщика (получен XML-файл).

source: Directory "%s" does not exist and cannot be emptied.
es: El directorio "%s" no existe y no puede ser vaciado.
fr: Le répertoire «%s» n'existe pas et ne peut pas être vidé.
pl: Katalog „%s” nie istnieje i nie można go opróżnić.
ru: Каталог "%s" не существует и его содержимое не может быть удалено.

source: Directory %s emptied
es: Directorio %s vaciado
fr: Répertoire %s vidé
pl: Katalog %s został opróżniony
ru: Содержимое каталога %s удалено

source: File %s does not exist, merge skipped.
es: El archivo %s no existe, se omitió la fusión.
fr: Le fichier %s n'existe pas, la fusion a été ignorée.
pl: Plik %s nie istnieje, scalanie zostało pominięte.
ru: Файл %s не существует, объединение пропущено.

source: %variablename% variable missing in file %filename%. Merge skipped.
es: Variable %variablename% no se encuentra en el archivo %filename%. Se omitió la fusión.
fr: La variable %variablename% est manquante dans le fichier %filename%. Fusion ignorée.
pl: Brak zmiennej %variablename% w pliku %filename%. Scalanie zostało pominięte.
ru: Переменная %variablename% отсутствует в файле %filename%. Объединение пропущено.

source: %variablename% variable missing in file %filename%. File %filename% deleted and merge skipped.
es: Falta la variable %variablename% en el archivo %filename%. Se eliminó el archivo %filename% y se omitió la fusión.
fr: La variable %variablename% est manquante dans le fichier %filename%. Fichier %filename% supprimé et fusion ignorée.
pl: Brak zmiennej %variablename% w pliku %filename%. Plik %filename% został usunięty, a scalanie zostało pominięte.
ru: Переменная %variablename% отсутствует в файле %filename%. Файл %filename% удален, объединение пропущено.

source: Unable to add %filename% to archive %archive%: %error%
es: No se puede agregar %filename% al archivo %archive%: %error%
fr: Impossible d'ajouter %filename% à l'archive %archive% : %error%
pl: Nie można dodać pliku %filename% do archiwum %archive%: %error%
ru: Не удалось добавить %filename% в архив %archive%: %error%

source: %filename% added to archive. %filescount% files left.
es: %filename% añadido al archivo. %filescount% archivos restantes.
fr: %filename% ajouté à l'archive. %filescount% fichiers restants.
pl: %filename% dodano do archiwum. Pozostało plików %filescount%.
ru: Файл %filename% добавлен в архив. Осталось файлов: %filescount%.

source: Could not close the Zip file %toFile%: %error%
es: No se pudo cerrar el archivo Zip %toFile%: %error%
fr: Impossible de fermer le fichier Zip %toFile% : %error%
pl: Nie można zamknąć pliku ZIP %toFile%: %error%
ru: Не удалось закрыть ZIP-файл %toFile%: %error%

source: %s is not a file
es: %s no es un archivo
fr: %s n'est pas un fichier
pl: %s nie jest plikiem
ru: %s не является файлом

source: Unable to create directory %s.
es: No ha sido posible crear el directorio %s.
fr: Impossible de créer le répertoire %s.
pl: nie można utworzyć katalogu %s.
ru: Не могу создать директорию %s.

source: Unknown extraction error (possible permission issue or filesystem error)
es: Error de extracción desconocido (posible problema de permisos o error del sistema de archivos)
fr: Erreur d'extraction inconnue (possible problème de permissions ou erreur du système de fichiers)
