Repository: pixelandbrick/sheridantools-prestashop
Catalog: modules/autoupgrade/translations/ModulesAutoupgradeAdmin.*.xlf
Languages: es, fr, pl, ru

source: There’s an issue processing the response on the app or browser.
es: Hay un problema al procesar la respuesta en la aplicación o el navegador.
fr: Il y a un problème lors du traitement de la réponse sur l'application ou le navigateur.
pl: Podczas przetwarzania odpowiedzi w aplikacji lub przeglądarce wystąpił problem.
ru: Возникла проблема при обработке ответа в приложении или браузере.

source: An unknown error occurred. It was unexpected and may be caused by a temporary issue with the server.
es: Se produjo un error desconocido. Fue inesperado y podría deberse a un problema temporal con el servidor.
fr: Une erreur inconnue s'est produite. Elle était inattendue et peut être causée par un problème temporaire avec le serveur.
pl: Wystąpił nieznany błąd. Było to nieoczekiwane i mogło być spowodowane przez tymczasowy problem z serwerem.
ru: Произошла неизвестная ошибка. Это было неожиданно и могло быть следствием временной проблемы с сервером.

source: Update failed
es: Actualización fallida
fr: La mise à jour a échoué
pl: Aktualizacja się nie powiodła
ru: Сбой обновления

source: Your store may not work properly anymore. Select the backup you want to use and restore it to avoid any data loss.
es: Es posible que tu tienda ya no funcione correctamente. Selecciona la copia de seguridad que quieras usar y restáurala para evitar la pérdida de datos.
fr: Il est possible que votre boutique ne fonctionne plus correctement. Sélectionnez la sauvegarde que vous souhaitez utiliser et restaurez-la pour éviter toute perte de données.
pl: Twój sklep może już nie działać poprawnie. Wybierz kopię zapasową, której chcesz użyć, i przywróć ją, aby uniknąć utraty danych.
ru: Ваш магазин может больше не работать должным образом. Выберите резервную копию, которую хотите использовать, и восстановите ее, чтобы избежать потери данных.

source: You didn’t back up your store with the Update assistant module but you can restore using your own manual backup.
es: No realizaste una copia de seguridad de tu tienda con el módulo Update assistant pero puedes restaurarla utilizando tu propia copia de seguridad manual.
fr: Vous n'avez pas sauvegardé votre boutique avec le module Update Assistant, mais vous pouvez la restaurer à l'aide de votre propre sauvegarde manuelle.
pl: Nie utworzono kopii zapasowej sklepu za pomocą modułu Asystenta aktualizacji, ale możesz przywrócić dane, korzystając z ręcznie wykonanej kopii zapasowej.
ru: Вы не выполнили резервное копирование своего магазина с помощью модуля "Помощник по обновлению", но вы можете восстановить его, используя собственную резервную копию, созданную вручную.

source: Post-update checklist
es: Lista de control post-restauración
fr: Post-mise à jour checklist
pl: Lista kontrolna po aktualizacji
ru: Контрольный список после обновления

source: Your store has been updated to PrestaShop version %version%
es: Tu tienda se ha actualizado a la versión %version% de PrestaShop
fr: Votre boutique a été mise à jour vers la version %version% de PrestaShop

source: Before continuing with your tasks, please review the following checklist to ensure smooth operation after recent updates.
es: Antes de continuar con las tareas, revisa la siguiente lista de verificación para garantizar un funcionamiento sin problemas después de las actualizaciones recientes.
fr: Avant de continuer vos tâches, veuillez consulter la checklist suivante pour vous assurer du bon fonctionnement de votre boutique suite aux mises à jour récentes.
pl: Przed kontynuowaniem zadań zapoznaj się z poniższą listą kontrolną, aby zapewnić prawidłowe działanie sklepu po niedawnej aktualizacji.
ru: Прежде чем продолжить работу, проверьте следующий контрольный список, чтобы обеспечить бесперебойное функционирование после обновлений.

source: Next steps
es: Próximos pasos
fr: Étapes suivantes
pl: Kolejne kroki
ru: Следующие шаги

source: %startbold%Open the developer documentation%endbold% to keep this checklist at-hand.
es: %startbold%Oabre la documentación para desarrolladores%endbold% para tener esta lista de verificación a mano.
fr: %startbold% Consultez la documentation développeur %endbold% pour garder cette liste de contrôle à portée de main.
pl: %startbold%Otwórz dokumentację programisty%endbold%, aby mieć tę listę kontrolną pod ręką.
ru: %startbold%Откройте документацию для разработчиков%endbold%, чтобы этот контрольный список был под рукой.

source: %startbold%Re-enable and check your modules%endbold% one by one to prevent any compatibility issue.
es: %startbold%Vuelve a habilitar y verifica tus módulos%endbold% uno por uno para evitar cualquier problema de compatibilidad.
fr: %startbold% Réactivez et vérifiez vos modules %endbold% un par un pour éviter tout problème de compatibilité.
pl: %startbold%Włącz ponownie moduły i sprawdź je%endbold% jeden po drugim, aby zapobiec problemom ze zgodnością.
ru: %startbold%Заново включайте и проверяйте свои модули%endbold% один за другим, чтобы предотвратить какие-либо проблемы совместимости.

source: %startbold%Make sure your store's front office is working properly:%endbold% try to create an account, place an order, add a product, etc.
es: %startbold%Asegúrate de que el front office de tu tienda está funcionando correctamente:%endbold% intenta crear una cuenta, realiza un pedido, añade un producto, etc.
fr: %startbold% Assurez-vous que le front-office de votre boutique fonctionne correctement : %endbold% essayez de créer un compte, de passer une commande, d'ajouter un produit, etc.
pl: %startbold%Upewnij się, że front office Twojego sklepu działa prawidłowo:%endbold% spróbuj utworzyć konto, złożyć zamówienie, dodać produkt itp.
ru: %startbold%Убедитесь, что раздел для работы с клиентами вашего магазина работает должным образом:%endbold% попробуйте создать учетную запись, разместить заказ, добавить продукт и т. д.

source: %startbold%Disable the maintenance mode%endbold% in General settings > Maintenance.
es: %startbold%Desactiva el modo de mantenimiento%endbold% en Configuración general > Mantenimiento.
fr: %startbold% Désactivez le mode maintenance %endbold% dans Paramètres généraux > Maintenance.
pl: %startbold%Wyłącz tryb konserwacji%endbold% w sekcji Ustawienia ogólne > Konserwacja.
ru: %startbold%Отключите режим обслуживания%endbold% в разделе "Общие настройки" > "Обслуживание".

source: %startbold%Check the %startlink%Module Manager%endlink%%endbold% to discover and install the modules extracted on your server during the update process.
es: %startbold%Cbloquea el %startlink%Module Manager%endlink%%endbold% para descubrir e instalar los módulos extraídos en tu servidor durante el proceso de actualización.
fr: %startbold%Vérifier le %startlink%Gestionnaire de Modules%endlink%%endbold% pour découvrir et installer les modules extraits sur votre serveur durant le process de mise à jour.

source: Troubleshooting
es: Solución de problemas
fr: Dépannage
pl: Rozwiązywanie problemów
ru: Решение проблем

source: If some images don't appear in the front office, try regenerating thumbnails in Preferences > Images.
es: Si algunas imágenes no aparecen en el front office, intenta regenerar las miniaturas en Preferencias > Imágenes.
fr: Si certaines images n'apparaissent pas dans le front-office, essayez de régénérer les miniatures dans Préférences > Images.
pl: Jeśli niektóre obrazy nie wyświetlają się we front office, spróbuj ponownie wygenerować miniatury w sekcji Preferencje > Obrazy.
ru: Если в разделе для работы с клиентами некоторые изображения отсутствуют, попробуйте заново сгенерировать эскизы в разделе "Настройки" > "Изображения".

source: If something's wrong, you can restore a backup with this module. Your backup is available at {admin}/autoupgrade/backup.
es: Si algo falla, puedes restaurar una copia de seguridad con este módulo. Tu copia de seguridad está disponible en {admin}/autoupgrade/backup.
fr: Si quelque chose ne va pas, vous pouvez restaurer une sauvegarde avec ce module. Votre sauvegarde est disponible dans {admin}/autoupgrade/backup.
pl: Jeśli coś jest nie tak, możesz przywrócić kopię zapasową za pomocą tego modułu. Twoja kopia zapasowa jest dostępna pod adresem {admin}/autoupgrade/backup.
ru: Если что-то идет не так, вы можете восстановить резервную копию с помощью этого модуля. Резервная копия доступна в каталоге {admin}/autoupgrade/backup.

source: If you can't access your back office, try enabling the debug mode manually in config/defines.inc.php by setting _PS_MODE_DEV_ to true.
es: Si no puedes acceder a tu back office, intenta habilitar el modo de depuración manualmente en config/defines.inc.php configurando _PS_MODE_DEV_ en true.
fr: Si vous ne pouvez pas accéder à votre back-office, essayez d'activer le mode debug manuellement dans config/defines.inc.php en définissant _PS_MODE_DEV_ sur true.
pl: Jeśli nie możesz uzyskać dostępu do back office, spróbuj ręcznie włączyć tryb debugowania w pliku config/define.inc.php, ustawiając zmienną _PS_MODE_DEV_ na wartość „true”.
ru: Если вы не можете получить доступ к рабочему кабинету, попробуйте включить режим отладки вручную в файле "config/defines.inc.php", установив для параметра "_PS_MODE_DEV_" значение "true".

source: Open developer documentation
es: Abrir documentación del desarrollador
fr: Ouvrir la documentation développeur
pl: Otwórz dokumentację dla programistów
ru: Откройте документацию для разработчиков

source: Back up your store
es: Realiza una copia de seguridad de tu tienda
fr: Sauvegarder votre boutique
pl: Utwórz kopię zapasową sklepu
ru: Создайте резервную копию магазина

source: Backing up your store's files, database, and images means you can restore to a previous version if something goes wrong during the update. This keeps your data safe and ensures your business stays up and running.
es: Hacer una copia de seguridad de los archivos, la base de datos y las imágenes de tu tienda te permite restaurar una versión anterior si surge algún problema durante la actualización. Mantienes tus datos seguros y garantizas que tu negocio siga funcionando.
fr: La sauvegarde des fichiers, de la base de données et des images de votre boutique signifie que vous pouvez restaurer une version antérieure en cas de problème lors de la mise à jour. Cela permet de protéger vos données et de garantir la continuité de votre activité.
pl: Tworzenie kopii zapasowych plików sklepu, bazy danych i obrazów oznacza, że możesz przywrócić poprzednią wersję, jeśli coś pójdzie nie tak podczas aktualizacji. Dzięki temu dane są bezpieczne, a Twoja firma może działać nieprzerwanie.
ru: Выполните резервное копирование файлов, базы данных и изображений вашего магазина. Это позволит восстановить предыдущую версию, если во время обновления что-то пойдет не так. Это обеспечит безопасность данных и бесперебойную работу вашего бизнеса.

source: Backup completed
es: Copia de seguridad completada
fr: Sauvegarde terminée
pl: Kopia zapasowa gotowa
ru: Резервное копирование завершено

source: It is available at /your-admin-directory/autoupgrade/backup. You're ready to start the update now.
es: Está disponible en /your-admin-directory/autoupgrade/backup. Ya puedes iniciar la actualización.
fr: Il est disponible dans /votre-répertoire-administrateur/autoupgrade/backup. Vous êtes prêt à démarrer la mise à jour maintenant.
pl: Jest dostępna w katalogu /twój-katalog-administratora/autoupgrade/backup. Możesz teraz rozpocząć aktualizację.
ru: Резервная копия доступна в каталоге /your-admin-directory/autoupgrade/backup. Теперь все готово к обновлению.

source: Include images in your backup
es: Incluir imágenes en tu copia de seguridad
fr: Inclure des images dans votre sauvegarde
pl: Uwzględnij obrazy w kopii zapasowej
ru: Включить изображения в резервную копию

source: Update without backup
es: Actualizar sin copia de seguridad
fr: Mettre à jour sans sauvegarde
pl: Aktualizacja bez kopii zapasowej
ru: Обновить без резервного копирования

source: Launch backup
es: Iniciar copia de seguridad
fr: Lancer la sauvegarde
pl: Uruchom tworzenie kopii zapasowej
ru: Запустить резервное копирование

source: Post-restore checklist
es: Lista de control post-restauración
fr: Post-restauration checklist
pl: Lista kontrolna po przywróceniu
ru: Контрольный список после восстановления

source: Your restoration is complete
es: Tu restauración está completa
fr: Votre restauration est complète
pl: Przywracanie zostało ukończone
ru: Восстановление завершено

source: Before continuing with your tasks, please review the following checklist to ensure smooth operation after recent recovery.
es: Antes de continuar con las tareas, revisa la siguiente lista de verificación para garantizar un funcionamiento sin problemas después de la recuperación reciente.
fr: Avant de continuer vos tâches, veuillez consulter la checklist suivante pour vous assurer du bon fonctionnement de votre boutique suite à votre restauration.
pl: Przed kontynuowaniem zadań zapoznaj się z poniższą listą kontrolną, aby zapewnić prawidłowe działanie sklepu po niedawnym odzyskaniu sprawności.
ru: Прежде чем продолжить работу, проверьте следующий контрольный список, чтобы обеспечить бесперебойное функционирование после восстановления.

source: If you can't access your back office, try emptying the cache.
es: Si no puedes acceder a tu back office, intenta vaciar el caché.
fr: Si vous ne pouvez pas accéder à votre back-office, essayez de vider le cache.
pl: Jeśli nie możesz uzyskać dostępu do back office, spróbuj opróżnić pamięć podręczną.
ru: Если вы не можете получить доступ к рабочему кабинету, попробуйте очистить кэш.

source: Deactivate non-native modules
es: Desactivar módulos no nativos
fr: Désactiver les modules non natifs
pl: Wyłącz moduły inne niż natywne
ru: Отключите сторонние модули

source: All the modules installed after creating your store are considered non-native modules. They might be incompatible with the new version of PrestaShop. We recommend deactivating them during the update.
es: Todos los módulos instalados después de crear tu tienda se consideran módulos no nativos. Pueden ser incompatibles con la nueva versión de PrestaShop. Recomendamos desactivarlos durante la actualización.
fr: Tous les modules installés après la création de votre boutique sont considérés comme des modules non natifs. Ils peuvent être incompatibles avec la nouvelle version de PrestaShop. Nous vous recommandons de les désactiver lors de la mise à jour.
pl: Wszystkie moduły zainstalowane po utworzeniu sklepu są uważane za moduły inne niż natywne. Mogą one być niezgodne z nową wersją PrestaShop. Zalecamy wyłączenie ich podczas aktualizacji.
ru: Все модули, установленные после создания магазина, считаются сторонними. Они могут быть несовместимы с новой версией PrestaShop. Мы рекомендуем деактивировать их на время обновления.

source: Regenerate email templates
es: Regenerar plantillas de correo electrónico
fr: Régénérer les templates d'e-mails
pl: Wygeneruj ponownie szablony wiadomości e-mail
ru: Повторное создание шаблонов электронной почты

source: If you've customized email templates, your changes will be lost if you activate this option.
es: Si ha personalizado plantillas de correo electrónico, los cambios se perderán si activas esta opción.
fr: Si vous avez personnalisé des templates d'e-mails, vos modifications seront perdues si vous activez cette option.
pl: Jeśli masz dostosowane szablony e-maili, zmiany zostaną utracone po aktywowaniu tej opcji.
ru: Если вы настроили шаблоны электронной почты, то при активации этого параметра ваши изменения будут потеряны.

source: Disable all overrides
es: Desactivar todos los métodos overrides
fr: Désactiver toutes les surcharges
pl: Wyłącz wszystkie nadpisania
ru: Запретить все переопределения

source: Overriding is a way to replace business behaviors (class files and controller files) to target only one method or as many as you need. This option disables all classes & controllers overrides, allowing you to avoid conflicts during and after updates.
es: Overriding es una manera de reemplazar comportamientos (archivos de clases y archivos de controladores) para enfocarte en un método o los que necesites. Esta opción desactiva todas las clases y controladores, permitiéndote evitar conflictos durante y después de las actualizaciones.
fr: Les overrides permettent de remplacer les comportements métier (fichiers de classe et fichiers de contrôleur) pour cibler une seule méthode ou autant que nécessaire. Cette option désactive tous les remplacements de classes et de contrôleurs, ce qui vous permet d'éviter les conflits pendant et après les mises à jour.
pl: Nadpisanie to sposób na zastąpienie działań biznesowych (plików klas i plików kontrolerów) w celu ukierunkowania na tylko jedną metodę lub na tyle metod, ile potrzebujesz. Ta opcja wyłącza wszystkie nadpisania klas i kontrolerów, co pozwala uniknąć konfliktów podczas aktualizacji i po ich zakończeniu.
ru: Переопределение — это способ изменения бизнес-процессов (файлов классов и файлов контроллеров) для одного или нескольких методов. Эта опция отключает переопределение всех классов и контроллеров, что позволяет избежать конфликтов во время и после обновлений.

source: Next
es: Siguiente
fr: Suivant
pl: Dalej
ru: Далее

source: You're up to date
es: Estás al día
fr: Votre boutique est à jour
pl: Wszystko jest aktualne
ru: Установлена последняя версия

source: Current PrestaShop version: %currentPrestashopVersion%
es: Versión actual de PrestaShop: %currentPrestashopVersion%
fr: Version actuelle de PrestaShop : %currentPrestashopVersion%
pl: Bieżąca wersja PrestaShop: %currentPrestashopVersion%
ru: Текущая версия PrestaShop: %currentPrestashopVersion%

source: Current PHP version: %currentPhpVersion%
es: Versión actual de PHP: %currentPhpVersion%
fr: Version PHP actuelle : %currentPhpVersion%
pl: Bieżąca wersja PHP: %currentPhpVersion%
ru: Текущая версия PHP: %currentPhpVersion%

source: Unlock the local update feature and manually update your store to your preferred upgrade by saving the archive and XML files of the PrestaShop version in the following directory on your server: %pathToLocalArchive%
es: Desbloquea la función de actualización local y actualiza manualmente tu tienda a la actualización que prefieras, guardando el archivo y los archivos XML de la versión de PrestaShop en el siguiente directorio en tu servidor: %pathToLocalArchive%
fr: Déverrouillez la fonctionnalité de mise à jour locale et mettez à jour manuellement votre boutique vers votre distribution personnalisée en enregistrant l'archive et le fichier XML de la version PrestaShop dans le répertoire suivant sur votre serveur : %pathToLocalArchive%
pl: Odblokuj funkcję aktualizacji lokalnej i ręcznie zaktualizuj sklep do preferowanej wersji, zapisując archiwum i pliki XML wersji PrestaShop w następującym katalogu na serwerze: %pathToLocalArchive%
ru: Разблокируйте функцию локального обновления и вручную обновите свой магазин до желаемой версии, сохранив архивные и XML-файлы текущей версии PrestaShop в следующем каталоге на вашем сервере: %pathToLocalArchive%

source: You are already using the latest PrestaShop version available but you can update to the version of your choice from a local archive.
es: Ya estás utilizando la última versión de PrestaShop disponible, pero puedes actualizar a la versión que elijas desde un archivo local.
fr: Vous utilisez déjà la dernière version de PrestaShop disponible, mais vous pouvez mettre à jour vers la version de votre choix à partir d'une archive locale.
pl: Korzystasz już z najnowszej dostępnej wersji PrestaShop, ale możesz zaktualizować ją do wybranej wersji z lokalnego archiwum.
ru: Вы уже используете последнюю доступную версию PrestaShop, но можете заменить ее до нужной версии из локального архива.

source: A more recent version is available
es: Hay una versión más reciente disponible
fr: Une version plus récente est disponible
pl: Dostępna jest nowsza wersja
ru: Доступна более новая версия

source: Select version
es: Seleccionar versión
fr: Sélectionner la version
pl: Wybierz wersję
ru: Выберите версию

source: A more recent version of PrestaShop is available. You can also use a local archive.
es: Está disponible una versión más reciente de PrestaShop. También puedes utilizar un archivo local.
fr: Une version plus récente de PrestaShop est disponible. Vous pouvez également utiliser une archive locale.
pl: Dostępna jest nowsza wersja PrestaShop. Możesz również skorzystać z lokalnego archiwum.
ru: Доступна более новая версия PrestaShop. Можно также использовать локальный архив.

source: Backup failed
es: La copia de seguridad falló
fr: La sauvegarde a échoué
pl: Tworzenie kopii zapasowej się nie powiodło
ru: Сбой резервного копирования

source: Please try again or perform a manual backup. In any case, ensure you have a backup before starting the update to avoid any data loss.
es: Inténtalo de nuevo o realiza una copia de seguridad manual. En cualquier caso, asegúrate de tener una copia de seguridad antes de iniciar la actualización para evitar la pérdida de datos.
fr: Veuillez réessayer ou effectuer une sauvegarde manuelle. Dans tous les cas, assurez-vous d'avoir une sauvegarde avant de lancer la mise à jour pour éviter toute perte de données.
pl: Spróbuj ponownie lub ręcznie utwórz kopię zapasową. W obu przypadkach upewnij się przed rozpoczęciem aktualizacji, że masz kopię zapasową, aby uniknąć utraty danych.
ru: Повторите попытку или выполните резервное копирование вручную. В любом случае перед началом обновления создайте резервную копию, чтобы избежать потери данных.

source: Retry backup
es: Reintentar copia de seguridad
fr: Réessayer la sauvegarde
pl: Spróbuj ponownie utworzyć kopię zapasową
ru: Повторить резервное копирование

source: Welcome to PrestaShop Update Assistant
es: Bienvenido a PrestaShop Update Assistant
fr: Bienvenue dans l'assistant de mise à jour de PrestaShop
pl: Witamy w Asystencie aktualizacji PrestaShop
ru: Вас приветствует модуль "Помощник по обновлению PrestaShop"

source: Update your store
es: Actualiza tu tienda
fr: Mettre à jour votre boutique
pl: Zaktualizuj swój sklep
ru: Обновите магазин

source: Update your store to benefit from the latest improvements, bug fixes and security patches.
es: Actualiza tu tienda para beneficiarte de las últimas mejoras, correcciones de errores y parches de seguridad.
fr: Mettez à jour votre boutique pour profiter des dernières améliorations, corrections de bugs et correctifs de sécurité.
pl: Zaktualizuj swój sklep, aby korzystać z najnowszych ulepszeń oraz poprawek błędów i zabezpieczeń.
ru: Обновите свой магазин, чтобы воспользоваться последними улучшениями, исправлениями ошибок и обновлениями безопасности.

source: Restore from a backup
es: Restaurar desde una copia de seguridad
fr: Restaurer à partir d'une sauvegarde
pl: Przywróć z kopii zapasowej
ru: Восстановить из резервной копии

source: Use this feature if the update failed or if your store or a module is no longer working properly.
es: Utiliza esta función si la actualización falló o si tu tienda o un módulo ya no funciona correctamente.
fr: Utilisez cette fonctionnalité si la mise à jour a échoué ou si votre boutique ou un module ne fonctionne plus correctement.
pl: Skorzystaj z tej funkcji, jeśli aktualizacja się nie powiodła albo jeśli Twój sklep lub moduł nie działa już prawidłowo.
ru: Используйте эту функцию, если обновление завершилось неудачно либо ваш магазин или модуль перестал работать должным образом.

source: No backup file found on your store.
es: No se ha encontrado ningún archivo de copia de seguridad en tu tienda.
fr: Aucun fichier de sauvegarde trouvé sur votre boutique.
pl: Nie znaleziono pliku kopii zapasowej sklepu.
ru: Для вашего магазина не найден файл резервной копии.

source: Get started
es: Empezar
fr: Commencer
